{"id": "74199025", "timestamp": "2020-04-05 23:59:42+00:00", "source": "complex.com", "title": "British Prime Minister Boris Johnson Hospitalized 10 Days After COVID-19 Diagnosis", "body": "On Sunday, British Prime Minister Boris Johnson was hospitalized \"for tests\" because of \"persistent\" COVID-19 symptoms 10 days after he tested positive, CNN reports. \nJohnson reportedly went to the unspecified London hospital after his doctor advised him to do so. A press release from his office called the move \"precautionary.\" \nOn March 26, Johnson revealed he had tested positive and that he had been dealing with symptoms since that date. Britain had gone into lockdown two days earlier.\nSince the 26th, Johnson has been quarantined at his Downing Street residence. He is the first known world leader to have contracted the virus. \nRoughly a month ago, right around the time the U.K. started dealing with an outbreak, Johnson garnered media coverage for saying he'd shook hands with coronavirus patients during a hospital visit.  \n\"I shook hands with everybody, you will be pleased to know, and I continue to shake hands,\" Johnson said during a press conference that took place on March 3. His positive test was registered 23 days later. \nOn Saturday, Johnson's fiancée, Carrie Symonds, tweeted out that she'd spent a week in bed with coronavirus symptoms. She had not officially been tested for the disease, but said she felt \"stronger\" and \"on the mend\" following the week of rest:"}
{"id": "74199021", "timestamp": "2020-04-05 23:59:36+00:00", "source": "sbs.com.au", "title": "NSW coronavirus death toll hits 18 as cases rise to 2637", "body": "NSW has now recorded 18 COVID-19 deaths as the state's total number of cases rises to 2637.\n\nNSW Health said on Monday the state had recorded 57 new cases - a drop on the previous day which was partly explained by fewer tests being done over the weekend.\n\nThe death toll rose to 18 after the deaths of an 86-year-old man and an 85-year-old man on Sunday.\n\nIt comes after NSW Police Commissioner Mick Fuller on Sunday announced an investigation into the circumstances surrounding the docking and disembarkation of passengers from the ill-fated Ruby Princess cruise ship.\n\nThe investigation - led by the NSW police homicide squad - aims to identify how passengers were allowed to disembark from the ship in Sydney, which is linked to 622 COVID-19 cases and at least 11 deaths across the country.\n\n\"The only way I can get to the bottom of whether our national biosecurity laws and our state laws were broken is through a criminal investigation,\" Mr Fuller said.\n\nMr Fuller told reporters transparency regarding patient health on board the cruise ship was a key question for the investigation.\n\nThe ship will dock in Port Kembla, near Wollongong on Monday.\n\nIt's expected to spend up to 10 days docked for medical assessments, treatment or emergency extractions of the crew, NSW Police say.\n\nThe investigation will cover the actions of the port authority, ambulance, police, the NSW Health department and Carnival Australia.\n\nThe NSW government on Sunday urged young people to take the COVID-19 pandemic seriously, revealing more than a quarter of the state's current coronavirus cases are in people aged under 29."}
{"id": "74199016", "timestamp": "2020-04-05 23:59:32+00:00", "source": "hindustantimes.com", "title": "Industry in Chandigarh will need major impetus by government post lockdown, say businessmen", "body": "ChandigarhWith shops and manufacturing units closed due to the curfew imposed to stop the spread of coronavirus disease (Covid-19), traders fear economic recovery will be difficult.It is for the first time that all business activity, trading and manufacturing, has been shut down in the city.“There is great uncertainty among businessmen as to what the future holds. People have even stopped planning how to manage the after-effects of the shutdown. We also don’t know for how long businesses will remain disturbed because of the Covid-19 pandemic,” said Neeraj Bajaj of the Chandigarh Business Council.In the city’s industrial area, more than 30,000 are employed in manufacturing and service units.“Beyond the short-term struggle, the industry will need major impetus from the government in the short and long term. There should be moratorium period or extension of six months for payment of liabilities including utility bills, taxes and duties to the government,” said Pankaj Khanna, president, industries association, Chandigarh.Industry is also seeking for loans accounts, which become non-performing assets (NPA) during lockdown, to not be considered wilful defaulters.“Stimulus package for MSMEs (micro, small and medium enterprises) should be considered for the financial year 2020-2021. Financial support for unorganized sectors will also be required,” Khanna said.Chandigarh Beopar Mandal wrote to Prime Minister Narendra Modi and Punjab governor and UT administrator VP Singh Badnore on Friday, seeking help, as they struggle to deal with the acute economic crisis caused by the pandemic.“We request the government to allow us to pay our employees ₹4,000 to ₹5,000 per month as ration cost till the lockdown continues,” the traders’ body stated in its communiqué.“Most of our traders have taken overdraft/CC limits or term loans in order to run their businesses. When there isno business activity, paying these interests is also a big challenge,” said Charanjiv Singh, chairman of the Chandigarh Beopar Mandal.FACTORY WORKERS ISSUED CURFEW PASSES TO FACILITATE WAGE DISBURSEMENT TO LABOURTo resolve the issue of payment of wages to more than 25,000 factory workers in the city, the UT administration has started issuing curfew passes to factory officials to allow them to disburse wages.“So far, we have issued 120 curfew passes for factory officials. In case there are any problems regarding this, we are taking them up on priority basis,” said Harjit Singh Sandhu, director, industries.Due to restrictions on movement imposed because of the curfew, both factory owners and workers have been facing problems with the disbursement of wages. Various industry associations had taken up the issue with the administration.The UT labour department, too, has contacted industrialists and factory owners regarding payment of wages to the labourers. “Around 10,000 labourers have already received their salaries. Efforts are being made to ensure that the remaining labour is paid wages at the earliest,” said a senior UT official, wishing not to be named.Meanwhile, household workers like maids, gardeners, etc are finding it difficult to collect their monthly salaries because of curfew restrictions. “The administration should devise a plan that allows household workers to collect their salaries from houses of their employers. They are not able to visit their workplaces and they don’t have curfew passes either. This is causing them a great deal of hardship,” said RK Garg, a city based social activist."}
{"id": "74199017", "timestamp": "2020-04-05 23:59:32+00:00", "source": "hindustantimes.com", "title": "Coronavirus in Chandigarh: Follow advisories, one cannot be too careful, says 23-year-old discharged patient", "body": "Chandigarh The 23-year-old man, discharged from the isolation ward of Government Medical College and Hospital (GMCH), Sector 32, after two weeks of treatment, is elated to be home.“I am feeling perfectly fine,” he said, as he arrived at his house in Sector 19 around 6pm. Son of a senior UT official, the youth had tested positive for Covid-19 on March 22 after he came in contact with the brother of Chandigarh’s first coronavirus patient, a 23-year-old woman from Sector 21.“One cannot be too careful. Though I did not have severe symptoms, all of us, even the young, are not immune to it. Advisories for social distancing and hand washing should be followed religiously,” he said.“During the course of my stay at the hospital, I learnt that there is nothing to be afraid of, but we need to be careful. My morale was high and I was confident of quick recovery,” he said, while adding that those affected by the disease should not lose hope as recovery was possible.The youth reported to the hospital after his fever rose, alerting him that he could be infected. “In isolation, even though I was not allowed to move out, I spent my days reading and talking to my friends. The doctors, nurses and the supporting staff were immensely helpful,” he said.The 25-year-old brother of the city’s first positive patient was also discharged from GMCH on Saturday. He had tested positive on March 20 after coming in contact with his sister, who flew back from the United Kingdom on March 15 and tested positive on March 18. Their mother, who had also contracted the infection, was discharged on Saturday.On his recovery, the youth said following the instructions of the doctors was vital to get cured at the earliest. “Different bodies react to the virus differently. I did not have many symptoms, while other positive patients had cough and fever. So, precautions are a must to contain the spread of the virus,” he said."}
{"id": "74199018", "timestamp": "2020-04-05 23:59:32+00:00", "source": "hindustantimes.com", "title": "Crackers sound jarring note as Chandigarh tricity lights up on PM Modi’s solemn plea", "body": "CHANDIGARH The stillness which had become so much a part of the tricity over the last two weeks was shattered by exploding firecrackers on Monday night as people in their enthusiasm to follow Prime Minister Narendra Modi’s solemn call for a candlelight vigil to unite to fight the coronavirus epidemic exceeded their brief to keep things low-key.Even as residents, following PM Modi’s Friday call to show solidarity and battle the pandemic, switched on their mobile phone lights and lit candles and diyas on Sunday at 9 pm, the sound of crackers sounded a jarring note. “This is the height of insanity and insensitivity to celebrate death and disease with so much pomp, show and bursting of crackers. This is a real wake of call for people who love India and the Indian ethos of compassion and humanism above all,” said, Pramod Sharma, who heads Yuvsatta, an NGO. “It was very peaceful initially. People had lit candles in their balconies, many were playing bhajans on their music systems, when suddenly crackers started popping. This was a solemn occasion, not something to celebrate,” said Nayna, a resident of Sector 43.Dr Ravindra Khaiwal , additional professor, environment health, The School of Public Health, Post Graduate Institute of Medical Education and Research, said, “The purpose (of lighting diyas) was for showing solidarity with the citizens who are at the forefront of dealing with the coronavirus outbreak, but a few people resorted to bursting of crackers. That’s an undesired step,” he said. “We are in the midst of a pandemic and people are celebrating as if it’s Diwali,” quipped Mohali mayor Kulwant Singh. Former railways minister and Congressman Pawan Kumar Bansal felt this showed “the over enthusiasm and hype built up over the PM’s announcement. What was supposed to be voluntary action has now become a must-do thing.”Crackers were burst in most parts of the tricity. In some localities, enthusiastic Bharatiya Janata Party workers resorted to sloganeering in favour of their party and PM Modi. “It appears that people, by bursting crackers, did not understand the sensitivity involved in the issue. The call was not for this,” said Dr Pramod Kumar, director, Institute for Development and Communication (IDC), Chandigarh."}
{"id": "74199019", "timestamp": "2020-04-05 23:59:32+00:00", "source": "hindustantimes.com", "title": "48% Covid-19 positive patients in Chandigarh tricity aged between 21-40", "body": "Chandigarh Health authorities have confirmed that majority of the 35 Covid-19 positive patients in the tricity, at 48.6%, are aged between 21 and 40.The age bracket hit the next hardest is between 41 and 60 years at 25.7%. Senior citizens, who are above 60 years, account for 20% of the positive cases, all from Mohali.In Chandigarh, it’s mostly the younger population that has been infected by the virus, as 72% of the 18 positive patients are in the age group of 21-40 years.Experts correlate this with the mobility of the young. “If we see the trend in Chandigarh, the five patients, who had travel history to foreign countries where Covid-19 cases were reported, are all below the age of 35,” said PVM Lakshmi, an epidemiologist at the Community Medicine and School of Public Health, Post Graduate Institute of Medical Education and Research (PGIMER). “The young individuals mostly mix up with their peers more than their families, and this is one reason that more cases were reported among the younger population in Chandigarh,” she added.On the contrary, the maximum cases in Mohali, at 46.6%, are in the 61 to 80 age group, while no one among the Chandigarh or Panchkula cases falls in this age bracket.Dr G Dewan, director health services, Chandigarh, said the disease’s trend here was the same as that found at the national level. Around 83% people infected in the country are below the age of 60, almost a similar trend seen in the tricity. “However, we need to be more cautious with regards to the senior citizens, especially those also suffering from comorbidities like diabetes and hypertension, as these have been associated with severe symptoms and complications,” he added."}
{"id": "74199015", "timestamp": "2020-04-05 23:59:28+00:00", "source": "nzherald.co.nz", "title": "Covid 19 coronavirus: Huge price hikes for essential goods during lockdown", "body": "A freezer that cost $949 on March 1 shot up to $1499 by March 31 as lockdown conditions limited trade across the country.\n  This is just one of a number of products to have seen significant price hikes during the lockdown, according to price comparison site PriceSpy.\n  The indexed price across all 108,000 products listed on PriceSpy increased by 5 per cent in March 2020.\n  READ MORE:\n• Covid 19 coronavirus lockdown: The Warehouse experiences huge demand for essential products\n• Covid 19 coronavirus: Briscoes, Mitre 10 join companies selling essential items\n• Covid 19 coronavirus: Essential goods expansion brings reprieve for struggling Kiwis\n• Coronavirus: Anger over Kmart selling fake tan as essential item but not stocking winter pyjamas\n   The biggest growth was seen in chest freezers which surged by 28 per cent between March 1 and 31. What's more is that 90 per cent of the chest freezers listed were found to cost more by the end of the month.\n  Webcams, heating and cooling products, washing machines, desktop PCs and ebook readers all shot up in price over this period.\n   \"Shockingly, the findings revealed 90 per cent of the top 10 most-click-on chest freezers cost more to buy on 31st March compared to 1st March, before the national Covid-19 alert system was implemented,\" said Liisa Matinvesi-Bassett, New Zealand country manager for PriceSpy.\n  \"Similarly, over three quarters [80 per cent] of the top 10 most-clicked-on webcams were more expensive to purchase at the end of the month compared to the start. A similar trend was also apparent for whiteware goods, with 70 per cent of the top 10 most-clicked-on items costing more on 31st March compared to 1st March.\"\n         The price hikes have been applied across categories. Photo / File   \n  Matinvesi-Bassett said that while fluctuations in pricing are to be expected, the price hikes in this instance have been \"extraordinary\".\n  \"If we are to compare like-for-like and look at the biggest savings offered across the top 10 most -clicked-on products across the same shopping categories, the most substantial saving found was for the Apple Mac Mini (2018), which cost $190 less on 31st compared to 1st March,\" she said.\n         There have been massive differences in prices. Photo / File   \n  \"During such unprecedented times, our key piece of advice to consumers who need to make an essential purchase right now is to be vigilant and conduct important price research before they commit and buy, as our insights suggest many products have received a price hike over this last month.\"\n  This data comes off the back of the Government's decision to allow certain retailers to sell a number of essential goods to get New Zealanders through the lockdown.\n   The move allowed the likes of the Warehouse, Noel Leeming, Briscoes and Mitre 10 to sell essential goods, such as heaters, whiteware and computers.\n         A number of products have seen a big lift in prices. Image / PriceSpy   \n  The decision was made in recognition of the need for people to safely isolate, stay connected to one another and work or study from home.\n  The stores have, however, faced massive demand as Kiwis rushed online to get their hands on essentials.\n  Key products include heaters, dehumidifiers, light bulbs and globes, hand tools, padlocks, firewood, batteries, sealants and silicones, work boots and gumboots, workwear, torches, spouting, downpipes, smoke alarms, child safety items and small household appliances.\n   • Covid19.govt.nz: The Government's official Covid-19 advisory website"}
{"id": "74199004", "timestamp": "2020-04-05 23:59:18+00:00", "source": "inquirer.net", "title": "Holy Week rites worldwide disrupted, but not spirit", "body": "Attendees sit by palm branches as Pope Francis celebrates Palm Sunday Mass behind closed doors in St. Peter’s Basilica, at the Vatican, Sunday, April 5, 2020, during the lockdown aimed at curbing the spread of the COVID-19 infection, caused by the novel coronavirus. (AP Photo/pool/Alberto Pizzoli)\n\n\nMANILA, Philippines s— For Pope Francis at the Vatican, and for Christians worldwide from churches large and small, this will be an Easter like none other: The joyous message of Christ’s resurrection will be delivered to empty pews.\n\nWorries about the coronavirus outbreak have triggered widespread cancellations of Holy Week processions and in-person services. Many pastors will preach on TV or online, tailoring sermons to account for the pandemic.\n\n\n\nMany extended families will reunite via Face Time and Zoom rather than around a communal table laden with an Easter feast on April 12.\n  \n\n“I’ll miss Mass and the procession,” said Aida Franco, 86, a retired teacher from Quito, Ecuador. “But God knows better.”\n\nNear-empty basilica\n\nPope Francis, the first Pontiff from Latin America, will be celebrating Mass for Palm Sunday, Holy Thursday and Easter in a near-empty St. Peter’s Basilica, instead of in the huge square outside filled with Catholic faithful.\n\nIn the Pope’s native Argentina, the archbishopric of La Plata encouraged the faithful to use any type of plant at home for a “virtual” blessing that will be live-streamed during Palm Sunday services this weekend.\n\nThe pandemic has prompted the cancellation of a renowned annual tradition of sawdust and handmade flower carpets coating the streets of Antigua, a colonial Guatemalan city, during its Holy Week procession. Instead, some residents will make smaller carpets to display outside their homes.\n\n“We know this is happening because of some message from God,” said Cesar Alvarez, who has been making the multicolored carpets with his family for 28 years. “But we’re taking it with a lot of sadness.”\n\t\t\t\t\n\n\t\t\t\t\t\n\t\t\t\n\nIn some communities, there are innovative efforts to boost Easter time morale.\n\nDistancing at egg hunt\n\nAt Asbury United Methodist Church in Prairie Village, Kansas, family ministries director Heather Jackson is organizing an Easter egg hunt that embraces social distancing.\n\nParents and children are creating colorful images of Easter eggs to display in windows or on garage doors, and the “hunt” will entail families driving around in their cars, or strolling on foot, trying to spot as many eggs as possible.\n\n“It’s about keeping people safe while maintaining that sense of joy,” Jackson said. “It will be a difficult time because it’s a time for families to come together and right now we just can’t do that.”\n\nIf not for the virus, 32-year-old Chris Burton—a writer, teacher and devout Baptist in Brooklyn, New York—would be planning a trip to Maryland for Easter dinner with his family. Instead, he plans to watch the online service of his church, Trinity Baptist, and then catch up with relatives by phone.\n\nBurton, who has experienced five bouts of pneumonia since 2011, has blogged about the need to shelter in place. Yet he still hopes this Easter will rekindle the uplifting emotions he’s cherished since wearing his Easter suit in childhood.\n\n“All that’s happening doesn’t mean we need to be somber,” he said.\n\nPriest-carrying vehicles\n\nIn Venezuela, Catholic officials said that after the Holy Week liturgies, some priests would try to take the Blessed Sacrament—the wine and bread of Holy Communion—on a vehicle and, using loudspeakers, invite congregants to join in spirit from their windows and balconies.\n\t\t\t\t\n\n\t\t\t\t\t\n\t\t\t\n\nA similar use of priest-carrying vehicles was adapted in the Philippines, Asia’s bastion of Catholicism. Locals lined up in front of their homes in several districts of Manila and Quezon City, which are entering its fourth week of a lockdown that has brought the frenetic metropolis nearly to a halt.\n\nThe priests made signs of the cross as they rolled past waving residents marking Palm Sunday, the start of the week that culminates with the observance of Easter.\n\n“This celebration will continue despite the spread of the virus,” said Bong Sosa, who attended wearing a mask crafted from a water cooler bottle.\n\nIn Brazil, the world’s biggest Catholic country, Rio de Janeiro’s huge Christ the Redeemer statue has been closed indefinitely. Large Holy Week gatherings are banned in several states after a federal court overruled a decree by President Jair Bolsonaro exempting religious services from quarantine measures.\n\nMany faithful across Latin America say they’ll miss Holy Week’s observances, yet there is acceptance of the cancellations.\n\nHealth first\n\n“It’s sad because we can’t be with our Lord in his Calvary, but it’s fine,” said Felipe Navarrete of Santiago, Chile. “The health of the population comes first, and we have to be responsible with older people who join these rituals the most.”\n\nMany pastors are pondering their upcoming Easter sermons, including the Rev. Steven Paulikas of All Saints Episcopal Church in Brooklyn. His sermon will be transmitted online but delivered in an empty church.\n\n“It’s started me thinking about the empty tomb,” he said, referring to the biblical account of Christ’s resurrection after his crucifixion.\n\t\t\t\t\n\n\t\t\t\t\t\n\t\t\t\n\n“That emptiness was actually the first symbol of this new life,” Paulikas said.\n\nOn the evening of April 9—Holy Thursday commemorating the Last Supper of Jesus and his apostles—Paulikas is organizing a communal supper for his congregation, hoping members will join via Face Time.\n\nSounds and images\n\nAt St. Ambrose Catholic Church in Brunswick, Ohio, Father Bob Stec is organizing a pre-Easter initiative, arranging for each of the parish’s 5,500 families to get a friendly call from another member.\n\nHe’s expecting upwards of 20,000 people to watch the online Easter service.\n\n“We’re going to try to flood their senses visually and audibly with the sounds and images that will give them hope,” he said.\n\n  \n           \n\n\n\n Subscribe to Notifications\n\n\n\n\n\n\n\n  Unsubscribe from Notifications\n\n\n\n  \n    \n  \n    \n\n    \n\n    \n\t\n\t\n\t  \n\n    \n\t\n\n    \n    Outbrain"}
{"id": "74199005", "timestamp": "2020-04-05 23:59:18+00:00", "source": "inquirer.net", "title": "Crucifixion site on lockdown to block penitents", "body": "Local tourists pose by crosses before a re-enactment of the crucifixion of Jesus Christ for Good Friday celebrations ahead of Easter in the village of Cutud near San Fernando, north of Manila on April 14, 2017.\nDevotees in the fervently Catholic Philippines nailed themselves to crosses and whipped their backs in extreme acts of faith that have become an annual tourist attraction. / AFP PHOTO / NOEL CELIS\t\t\n\n\t\n    \n    \n      CITY OF SAN FERNANDO, Pampanga, Philippines — The new coronavirus is poised to bring to a stop this Holy Week the crucifixion rites in the village of San Pedro Cutud here.\n\nBarangay Cutud, where some 5,000 penitents would end their flagellation and crucifixion on Good Friday, has been placed on total lockdown since Palm Sunday to stop the spread of infection.\n\nSix policemen were sent to the area to guard the three entrances to the village, said Cutud chair Remegio de la Cruz. “I do not want foreigners and local spectators to come,” he told the Inquirer by phone.\n\n\n\nThe village’s Good Friday events, ending on a version of Calvary, had been drawing 30,000 to 50,000 spectators annually due to real-life crucifixion rites.\n  \n\nHardheaded villagers\n\n“This coronavirus disease must be stopped from being transmitted,” De la Cruz said. “There are some villagers who are hardheaded, but I am strict. So they better obey me or else.”\n\nRuben Enaje, 59, a house and billboard painter, regularly took on the role of Jesus Christ in “Via Crucis” (Way of the Cross), the play staged on the streets of Cutud.\n\nBut local officials have asked Enaje and other penitents to drop the crucifixion rites after President Duterte ordered a stop to the gathering of people in big numbers to curb the spread of COVID-19.\n\nEnaje said he would just carry a 37-kilogram wooden cross from his house to the hill on Good Friday.\n\n—TONETTE OREJAS\n\t\t\t\t\n\n\t\t\t\t\t\n\t\t\t\n\n  \n           \n\n\n\n Subscribe to Notifications\n\n\n\n\n\n\n\n  Unsubscribe from Notifications\n\n\n\n  \n    \n  \n    \n\n    \n\n    \n\t\n\t\n\t  \n\n    \n\t\n\n    \n    Outbrain"}
{"id": "74199006", "timestamp": "2020-04-05 23:59:18+00:00", "source": "inquirer.net", "title": "COVID-19 patients to waive confidentiality", "body": "COVID-19 patients to waive confidentiality\n\n\n    \n\t\n\n\t\tBy:  Dona Z. Pazzibugan\n\t\t\t\t-\t\t47 seconds ago\n\t\n\n\n  \n  \n  \n    \n      MANILA, Philippines — No less than the country’s top medical and legal groups have called on authorities to disclose the identities of COVID-19 patients and so-called persons under investigation (PUIs), saying many patients continue to withhold their true medical history thus endangering the thinning ranks of healthcare workers.\n\nThe Philippine Medical Association and Philippine College of Surgeons together with the Integrated Bar of the Philippines appealed to COVID-19 patients and PUIs to voluntarily waive the confidentiality of their medical information and inform those they have recently been in close contact with.\n\nThey also urged the Department of Health to “prudently use and promptly share the medical information” to all concerned so they could take precautionary and remedial measures. Justice Secretary Menardo Guevarra said he “strongly” supported the call and affirmed the “ethical and legal basis” laid down by the Philippine Medical Association and the Data Privacy Commission to justify waiving the medical confidential rule “in times of public health emergency.”\n\n\n\nHe also strongly supports the call of the Integrated Bar of the Philippines on COVID-19 positive individuals and PUIs “for the waiver of confidentiality of their medical condition,” Guevarra told reporters on Sunday.\n  \n\n“This will enable other people they have been in close contact with to take the necessary precautions or remedial measures to protect themselves, without having to further burden the Department of Health with the tedious task of contact tracing,” he added.\n\nThe three medical and legal groups made the appeal in a joint statement on April 4, three weeks since the enhanced community quarantine to contain the outbreak.\n\nIn justifying their call to waive the medical confidentiality rule, they reported increasing incidents in which COVID-19 patients continue to withhold their true medical condition when seeking treatment or hospital admission “thereby compromising the health institutions and the health workers,” many of whom have died or fell ill from the infectious disease.\n\nEven without the individual waiver, they said, existing laws and rules grant the government “sufficient authority and basis” to lift the confidentiality of the medical condition of COVID-19 patients and PUIs.\n\nThese include Republic Act 11332 or the 2018 Law on Reporting of Communicable Diseases, which makes illegal the “non-cooperation of persons and entities” in times of public health emergencies.\n\t\t\t\t\n\n\t\t\t\t\t\n\t\t\t\n\nThe confidentiality of a patient’s medical data and details is “not absolute” and can be lifted “when the public health and safety so demand” or “when the patient waives his right,” the three groups pointed out.\n\nArticle III Section 3 of the Code of Ethics of the Medical Profession, they said, exempts a physician from keeping private and highly confidential a person’s medical information “when required by law, ordinance or administrative order in the promotion of justice, safety and public health.”\n\nThe Health Privacy Code specifying the Joint Administrative Order No. 2016-0002 or the privacy guidelines for the implementation of the Philippine Health Information Exchange, also allows that “in case of emergency where time is of the essence, disclosure may be made even without court order.”\n\n  \n           \n\n\n\n Subscribe to Notifications\n\n\n\n\n\n\n\n  Unsubscribe from Notifications\n\n\n\n  \n    \n  \n    \n\n    \n\n    \n\t\n\t\n\t  \n\n    \n\t\n\n    \n    Outbrain"}
{"id": "74199007", "timestamp": "2020-04-05 23:59:18+00:00", "source": "inquirer.net", "title": "Bishop: Holy Week is about love, not rituals", "body": "A Roman Catholic priest riding on a tricycle and wearing a face mask blesses the faithfuls holding coconut leaves during Palm Sunday event in Borongan town, Eastern Samar province, central Philippines on April 5, 2020, as part of the Easter observance. - Church authorities have asked the catholic faithfuls not to go to churches for the Palm Sunday blessing, but instead to stay in front of their houses as priests will go around their communities for the blessing, to observe social distancing as part of the government efforts to combat COVID 19 pandemic. (Photo by Alren BERONIO / AFP)\t\t\n\n\t\n    \n    \n      MANILA, Philippines — The new coronavirus failed to keep Filipino Catholics from observing Palm Sunday.\n\nPriests went around communities in lockdown to bless palm fronds waved by people from the front of their houses or delivered blessing from the back of trucks and motorized tricycles.\n\nIn a photo posted on CBCP­News, the official news service of the Catholic Bishops’ Conference of the Philippines (CBCP), a priest blesses palm fronds from a tricycle in Borongan City, Eastern Samar.\n\n\n\nManila Auxiliary Bishop Broderick Pabillo, in his homily during Palm Sunday Mass at Manila Cathedral that was live-streamed on Facebook, said liturgical activities this year would be a lot different, “but Holy Week must continue.”\n  \n\nBright side\n\nCatholics in many parts of the world may miss the “externalities” of the celebrations, he said, but “this may be a good chance for us to go into the essence of what we are doing.”\n\n“There is always a bright side in what is happening even in this COVID-19 pandemic,” he said.\n\nPabillo urged the faithful to spend the remaining days of the Luzon lockdown in prayer and reflection.\n\n“Let us not mind so much that we are already in the fourth week of the lockdown. Let us not complain. But let us use this silence and inactivity of the lockdown this Holy Week to reflect and to pray,” he said.\n\nHe encouraged the faithful to think of the difficulties brought about by COVID-19 as a way of being one with Jesus, who died for mankind.\n\t\t\t\t\n\n\t\t\t\t\t\n\t\t\t\n\n“Of course, after four weeks, there are already lots of complaints, not only of inconvenience, not only of boredom, but, even for some, because of great need. They might be hungry already. Let us join all these sufferings to that of Jesus. He loves us so much that he suffered for us,” Pabillo said.\n\n“We welcome him today, let us continue to welcome him. We recognize him and he still comes to us in the ordinariness of our lives even when we are under quarantine. It’s good to pause and see how is the Lord coming to us during these days,” he added.\n\nThis Holy Week is a good time to reflect on why Jesus suffered so much and that his suffering should “lead us to sorrow and gratitude—sorrow for our sins, for our indifference, and gratitude for his great love and solidarity with us,” Pabillo said.\n\nNot less holy\n\n“We may be celebrating this year’s Holy Week differently, but hopefully, more deeply,” he said, adding that the absence of traditional religious activities does not make Holy Week less holy.\n\nLingayen-Dagupan Archbishop Socrates Villegas echoed Pabillo’s views, saying Holy Week is about love, not rituals.\n\n“Love makes us holy. Love, not rituals, is the spirit of Holy Week,” he said.\n\nFr. Jerome Secillano, executive secretary of the CBCP public affairs committee, also said Holy Week “shouldn’t be less holy since what makes it really holy is the sacrifice of Christ and not the participation of people.”\n\n—TINA G. SANTOS\n\t\t\t\t\n\n\t\t\t\t\t\n\t\t\t\n\n  \n           \n\n\n\n Subscribe to Notifications\n\n\n\n\n\n\n\n  Unsubscribe from Notifications\n\n\n\n  \n    \n  \n    \n\n    \n\n    \n\t\n\t\n\t  \n\n    \n\t\n\n    \n    Outbrain"}
{"id": "74199008", "timestamp": "2020-04-05 23:59:18+00:00", "source": "inquirer.net", "title": "Christianity’s most somber time spent somberly", "body": "Christianity’s most somber time spent  somberly\n\n\n    \n\t\n\n\t\tBy:  Ador Vincent Mayol, Joey Gabieta\n\t\t\t\t-\t\t3 hours ago\n\t\n\n\n  \n  \n  \n        \n    \n      LIVESTREAM The Mendoza family of Bagong Silangan village in Quezon City attends Palm Sunday Mass via online broadcasting or livestreaming, amid the spread of the coronavirus disease that has forced the government to put the entire island of Luzon on lockdown. (Photo by NIÑO JESUS ORBETA / Philippine Daily Inquirer)\n\n\nTACLOBAN CITY, Leyte, Philippines — Zenaida Oledan woke up at 5:30 a.m. on Sunday determined to do one thing.\n\n“I want to have my palm fronds blessed,” said the 54-year-old mother of four.\n\n\n\nOledan was among several residents who lined the city streets of Barangay 6 to observe Palm Sunday, the start of Holy Week—the most somber time of the year in Christianity.\n  \n\nGoing to the community\n\nBut unlike in previous years, the Catholic faithful were requested to stay at home in a bid to contain the spread of the new coronavirus, which causes the deadly COVID-19.\n\nMsgr. Erlito Maraya, head priest of Sacred Heart Parish in Tacloban, went out to the community to bless the people’s homemade palm fronds.\n\nOledan was glad about Maraya’s bringing the Palm Sunday tradition to people’s homes. “At least even during this time of COVID-19, we’re still able to observe Palm Sunday,” she said, holding the palm she had bought.\n\nIn Cebu, Archbishop Jose Palma presided over Palm Sunday Mass at an empty Cebu Metropolitan Cathedral. But Gov. Gwendolyn Garcia was there to see him consecrate Cebu to the Our Lady of Guadalupe, the island’s patroness.\n\n“In the midst of fear and anxiety caused by COVID-19, even great nations are at a loss about what to do. We have no solution. [The best we can do] is to bend down our knees in prayer,” Palma said in his homily.\n\t\t\t\t\n\n\t\t\t\t\t\n\t\t\t\n\nGratitude to medical workers\n\nHe expressed gratitude to all medical workers who, he said, were like Jesus who sacrificed his life for the good of many.\n\n“These people exposed themselves to risk and yet they are there. We admire people who are willing to take the risk knowing that life is precious. This is the image of Jesus who offered his life so that others may live,” Palma said.\n\n“In time of COVID, we should be serious in giving value to life. We’re confronted with a serious case and I hope people will follow what authorities are implementing,” he added.\n\nOn March 17, Palma ordered the suspension of Masses in Cebu amid increasing COVID-19 cases. He urged parishes in the archdiocese to use technology to bring church services to people, especially those who are in quarantine.\n\nOn Negros Island, people attended services — Catholic and Protestant — through television.\n\nSome of them put palm fronds on their gates as a reminder of Palm Sunday.\n\n—WITH A REPORT FROM CARLA GOMEZ\n\n\n\t\t\t\t\n\t\t\t\t\t\n\t\t\t\n  \n           \n\n\n\n Subscribe to Notifications\n\n\n\n\n\n\n\n  Unsubscribe from Notifications\n\n\n\n  \n    \n  \n    \n\n    \n\n    \n\t\n\t\n\t  \n\n    \n\t\n\n    \n    Outbrain"}
{"id": "74199009", "timestamp": "2020-04-05 23:59:18+00:00", "source": "inquirer.net", "title": "Fighting a pandemic: When healers need healing themselves", "body": "THE BEST AND WORST IMPULSES Risking infection by the coronavirus as they provide care for patients on their watch, medical workers also face discrimination by people afraid for their lives. —PHOTO COURTESY OF KATH VALDEZ\n\n\nMANILA, Philippines — “You really need to be strong in this profession,’’ said Kath Valdez, a ward nurse at the Philippine General Hospital (PGH) in Manila, who has seen how the usually crowded halls of PGH turned empty and eerily quiet, except for the muffled suffering of patients battling a virulent disease that has also taken its toll on health workers like her.\n\n“(You have) to put so much heart into it so that you can help people (deal), not only with their physical pain but also the emotional and mental challenges they are going through,” she said.\n\n\n\nAfter PGH was designated by the Department of Health as an “end referral hospital” for COVID-19 cases, Valdez recalled, she started taking care of one patient whose condition was made worse by bouts of depression. Two of the patient’s family members had died from COVID-19, while the rest were recovering.\n  \n\n“She is isolated and alone in PGH, and cannot do anything. It’s too sad to see patients like that. All I can offer is myself, a person who will listen to her,” said Valdez.\n\nHealth workers get so invested in their work that they sometimes forget to take care of themselves, she said, and “this eventually leads to burnout and similar challenges.”\n\nAnother source of anguish\n\nBut lately, another source of their mental anguish has surfaced — one that stalks nurses and health workers the moment they step out of the hospital.\n\nValdez has experienced it herself: One day as she walked home, her neighbors hurried back inside their houses, avoiding her like the plague. She has also heard stories of health workers being forced out of their rented places because of fear that they could infect the entire community.\n\n“I know (people) are just being careful,” she said. “But I wish they would be kinder and more considerate to us, especially during this time of crisis,” Valdez said.\n\t\t\t\t\n\n\t\t\t\t\t\n\t\t\t\n\nSupport groups\n\nTo help themselves cope, nurses in the state-run hospital turn to their support group—“PGH Care Society”—to help each other out of emotional and psychological lows through professional and peer interventions.\n\nOther groups, such as Ugat Foundation and the University of the Philippines Diliman’s PsycServ (UPD PsycServ), have been offering telepsychotherapy and psycho-emotional counseling services for front-line health workers and people experiencing stress or anxiety during the COVID-19 pandemic.\n\nLike other PGH nurses, Valdez has developed the fear of getting the virus and infecting others, as well as a sense of helplessness for not being able to do everything for the patients.\n\n“We’ve also faced (cases of) infectious diseases in the past, but this is something that we didn’t expect to blow up like this. It totally changed our working environment. There is fear, anxiety, and uncertainty all around,” said Valdez, who lives with friends in Manila while her entire family is abroad.\n\nThe PGH Care Society, a mental health advocacy group whose members include Valdez, provides a platform for nurses to freely express their feelings as a form of unburdening and release. Through online exchanges, they can hopefully unload negative feelings and deal more strongly with “one of the most challenging times of their career,” Valdez said.\n\nOnline counseling\n\nUgat Foundation, meanwhile, is a group helping Filipino families, overseas Filipino workers (OFWs) and marginalized individuals cushion the physical and psychological impact of the coronavirus outbreak.\n\nOn April 2, it launched Ugat Sandaline, an online platform that provides psycho-emotional counseling services to people affected by the pandemic, especially medical front-liners and other responders deployed by the government.\n\n“They need a lot of support now, and hopefully, crisis counseling empowers them in their valiant efforts to fight COVID-19 and ensure the safety and health of the Filipino people,” the group said.\n\t\t\t\t\n\n\t\t\t\t\t\n\t\t\t\n\nUgat Sandaline volunteers include psychologists, mental health professionals, and psychology graduate students who are trained to listen to and empathize with those needing emotional support, whether through video, voice call or online chat.\n\n“In cases such as pandemics, when compliance is critical to the nation’s efforts to ‘flatten the curve,’ feeling heard or having an outlet to ventilate feelings will hopefully also enable more (people) to comply with national and local government efforts,” the group said in a statement.\n\nFor other ‘essential’ workers\n\nA third help group, UPD PsycServ, has expanded its free telepsychotherapy services to reach out not only to health workers but also to persons under investigation or monitoring for coronavirus symptoms, and COVID-19-positive individuals and their relatives.\n\nIt also offers a comforting hand to security guards, store cashiers, janitors and other “essential” workers who still have to go to work—and face the risk of being infected—while the Luzon-wide lockdown is in effect.\n\nOnline sessions with the group can be scheduled through text, Viber or an online form posted on the group’s Facebook page.\n\nSometimes a simple “kumusta” (how are you?) suffices to renew their strength, Valdez said.\n\n“As health workers, we’re used to asking others: Kumusta ka? So it’s time that we also take care of our fellow nurses and front-liners,” she said. “That one simple question can totally change someone’s perspective and feelings.”\n\n\n\t\t\t\t\n\t\t\t\t\t\n\t\t\t\n  \n           \n\n\n\n Subscribe to Notifications\n\n\n\n\n\n\n\n  Unsubscribe from Notifications\n\n\n\n  \n    \n  \n    \n\n    \n\n    \n\t\n\t\n\t  \n\n    \n\t\n\n    \n    Outbrain"}
{"id": "74198985", "timestamp": "2020-04-05 23:58:52+00:00", "source": "arstechnica.com", "title": "Zoombombing is a crime, not a prank, prosecutors warn", "body": "Coronavirus-related social distancing measures have given a big popularity boost to Zoom, a video conferencing platform that's known for its ease of use but not necessarily strong security or privacy protections. Internet trolls and other troublemakers have responded with \"Zoombombing\": joining Zoom meetings uninvited and disrupting them. Zoombombers have exposed themselves to schoolchildren and shouted racial slurs.\n\nIn a Friday statement, federal prosecutors in Michigan warned the public that Zoombombing isn't a harmless prank; it's a crime.\n\n\"Hackers are disrupting conferences and online classrooms with pornographic and/or hate images and threatening language,\" wrote the US Attorney's Office for the Eastern District of Michigan. \"Anyone who hacks into a teleconference can be charged with state or federal crimes.\"\n\nPossible charges include \"disrupting a public meeting, computer intrusion, using a computer to commit a crime, hate crimes, fraud, or transmitting threatening communications,\" the prosecutors warn. All of these charges come with the potential for fines and jail time, the authorities say.\n\nThe exact charges a Zoombomber faces would presumably depend on how they gained access to a Zoom meeting and what they did to disrupt it. For example, some Zoom meetings are advertised publicly, which might make it hard to make a computer intrusion charge stick. But someone could still be prosecuted for things they said or did to disrupt the meeting after joining it.\n\n“You think Zoombombing is funny? Let’s see how funny it is after you get arrested,” Michigan US attorney Matthew Schneider said in Friday's release. “If you interfere with a teleconference or public meeting in Michigan, you could have federal, state, or local law enforcement knocking at your door.”\n\nIn a recent story, Ars Technica security reporter Dan Goodin explained how Zoom users can protect themselves from Zoombombing attacks. He noted that meetings can be password-protected, and he advised against announcing login information on social media or other public channels.\n\nGoodin notes that hosts can disable Zoom's \"Join Before Host\" setting to ensure that the host is in control of a meeting from the outset. Zoom also has a \"waiting room\" feature, allowing a host to verify participants before allowing them to join the meeting."}
{"id": "74198971", "timestamp": "2020-04-05 23:58:41+00:00", "source": "itv.com", "title": "Boris Johnson spends night in hospital as he battles coronavirus", "body": "Prime Minister Boris Johnson is spending the night in hospital after he was admitted for tests as his coronavirus symptoms persist.\nHe will stay for “as long as needed” in the London NHS hospital where he was taken as a “precautionary step” on the advice of his doctor – rather than as an emergency.\nThe news came just an hour after the Queen delivered a message of hope to the nation amid the Covid-19 pandemic, saying “we will overcome it” although we “may have more still to endure”.\n\n\n\n\n\n  A total of 4,934 patients – including frontline healthcare workers – have died in hospital after testing positive for coronavirus in the UK according to the latest figures issued by the Department of Health.\nMr Johnson, 55, tested positive for the virus 10 days ago, and has been in self-isolation inside his Downing Street flat since.\nA Number 10 spokeswoman said: “On the advice of his doctor, the Prime Minister has tonight been admitted to hospital for tests.\n“This is a precautionary step, as the Prime Minister continues to have persistent symptoms of coronavirus 10 days after testing positive for the virus.\n“The Prime Minister thanks NHS staff for all of their incredible hard work and urges the public to continue to follow the Government’s advice to stay at home, protect the NHS and save lives.”\n\n\n\n\n\n  US President Donald Trump was among the well-wishers, starting Sunday night’s White House press briefing by saying Mr Johnson was “a great friend of mine” and adding: “I’m sure he is going to be fine, he’s a strong man, a strong person.”\nIn a rare televised address to the nation, the Queen personally thanked frontline NHS staff, care workers and others for “selflessly” carrying out their essential roles which had brought “us closer to a return to more normal times”.\nShe thanked others for staying at homes, separated from friends and family, and echoed the words of Forces’ sweetheart Dame Vera Lynne’s Second World War anthem, when she said “we will meet again”.\nIt came as:\n– Scotland’s chief medical officer, Dr Catherine Calderwood, resigned following criticism for visiting her second home and not adhering to social distancing advice.\n– The Department of Health said the number of reported coronavirus-related hospital deaths had risen by 621 to 4,934 as of 5pm on Saturday, up from 4,313 the day before.\n– Princess Alexandra Hospital in Harlow confirmed Lynsay Coventry, 54, who died on Thursday, was the first serving midwife to die after testing positive for the virus.\n– Health Secretary Matt Hancock warned outdoor exercise could be banned if people continued to flout the social distancing rules.\n\n\n\n\n\n  Mr Johnson remains “in charge of the Government” and in contact with ministerial colleagues and officials despite his hospital admission, a spokesman said.\nBut de facto deputy prime minister Dominic Raab, the Foreign Secretary, is expected to chair the daily Covid-19 meeting on Monday morning in Mr Johnson’s place.\nHis persistent symptoms are understood to include a high temperature, and it was considered sensible for doctors to see the PM in person.\nMr Johnson’s pregnant fiancee Carrie Symonds said on Saturday that she was “on the mend” after spending a week in bed after also suffering coronavirus symptoms.\n\n\n\n\n\n  The 32-year-old, who is expecting the couple’s baby in early summer, has been self-isolating in Camberwell, south London, with the couple’s dog Dilyn.\nThe Prime Minister revealed on March 27 that he had tested positive for Covid-19 and was self-isolating with “mild symptoms” including a high temperature and persistent cough\nHe has shared several video updates from his Number 11 flat since the diagnosis, and stepped outside to join the nationwide clap for key workers on Thursday evening.\nMr Johnson has not been seen publicly since, but spoke to new Labour leader Sir Keir Starmer on Saturday afternoon.\nSir Keir wished the PM a “speedy recovery” after the announcement."}
{"id": "74198970", "timestamp": "2020-04-05 23:58:40+00:00", "source": "slate.com", "title": "Bronx Zoo Tiger Is First of Its Kind to Test Positive For Coronavirus", "body": "Nadia, a four-year-old female Malayan tiger at the Bronx Zoo, is seen in an undated photo provided by the zoo in New York.\n\nWildlife Conservation Society\n\n\n\n\n  \n\n  \n  Nadia, a four-year-old female Malayan tiger at the Bronx Zoo, has become the first tiger in the world to test positive for the coronavirus. It is the first known case of an animal contracting the coronavirus in the United States.  Nadia’s sister Azul, two Amur tigers, and three African lions have also developed a dry cough, a symptom that is typical of COVID-19 patients. Because of the difficulty of obtaining samples from big cats, only one was tested. Besides a bit of loss of appetite all the Bronx Zoo animals are doing well, the Wildlife Conservation Society’s Bronx Zoo said in a statement. The zoo has been closed since March 16.\n\n\n\n  \n\n\n\n  \n\n\n\n  \n  The U.S. Department of Agriculture confirmed the finding and said it marked the first case of a tiger testing positive for COVID-19. The big cats were likely infected by an asymptomatic staff member.\n\n\n\n  \n\n\n\n  \n\n\n\n  \n  Even though all the big cats infected with COVID-19 are expected to make a full recovery the positive test raises fresh questions about how the virus is transmitted to animals. No pets in the United States have tested positive for the virus and there is no evidence to suggest that animals can transmit COVID-19 to people. A dog in Hong Kong tested positive, which led officials to conclude animals could test positive if they had been exposed by humans but could not transmit the virus to humans.\n\n\n\n  \n  The USDA says anyone who is sick with the coronavirus should restrict contact with animals as much as possible. If someone who is sick with the coronavirus must take care of a pet or be around animals, “they should wash their hands before and after the interaction,” notes the USDA. Experts also recommend that pets of owners who are infected with COVID-19 should be kept inside as much as possible."}
{"id": "74198976", "timestamp": "2020-04-05 23:58:40+00:00", "source": "yahoo.com", "title": "WEEKLY ROUND-UP: Sports happenings in Singapore (30 March-5 April)", "body": "SINGAPORE — Here is a round-up of sports events and developments in the past week (30 March to 5 April):\nMost sports, recreation facilities to close from Tuesday\nSports and recreation facilities will be closed from Tuesday (7 April) to 4 May, as Singapore implements elevated safe distancing measures to curb the spread of COVID-19.\nThe closures include ActiveSG Sport Centres, studios, gyms, indoor sport halls, swimming complexes, Active Health Labs, as well as The Float and The Rink@JCube.\nAll recreational facilities in hotels will also be closed. All group sports and physical activities shall cease during the period, regardless of group size or location. This includes one-on-one private coaching sessions, as well as outdoor group physical activities.\nWhile public parks and 15 SportSG open-air stadiums will remain open, the Singapore government reminds the public to practise safe distancing in open spaces.\nThe 15 stadiums that will remain open are: Bedok, Bishan, Bukit Gombak, Choa Chua Kang, Clementi, Home of Athletics, Hougang, Jurong West, MOE (Evans), Queenstown, Serangoon, Toa Payoh, Woodlands, Yio Chu Kang, Yishun.\nList of services that will remain open during the period:\nBishan Sport Centre: Good Bites\n\nBukit Gombak Sport Centre: SingPost (POPStation)\n\nChoa Chu Kang Sport Centre: KFC, SingPost (POPStation), Star Learners@CCK Sports Centre\n\nHeartbeat@Bedok ActiveSG Sport Centre: Burger King, Heavenly Wang, NTUC Income Insurance Co-operative Bedok, Kaki Makan, QB House, RedMan at Heartbeat@Bedok, Ren Tian Tang Herbal Haircare, SuperGenius Preschool HBB, Subway, Swee Heng Bakery, Tian Ma Group, Unity Dental, Watson's Personal Care\n\nHougang Sport Centre: SingPost (POPStation)\n\nJalan Besar Sport Centre: Broadway Food Centre\n\nJurong East Sport Centre: KFC, PastaMania, SingPost (POPStation)\n\nJurong West Sport Centre: MindChamps PreSchool@Jurong West, The Enrichment Childcare, SingPost (POPStation)\n\nPasir Ris Sport Centre: Burger King, Kcuts, McDonald's, MSF Social Service Office, SingPost (POPStation)\n\nSengkang Sport Centre: Kcuts, PastaMania, SingPost (POPStation), Star Learners\n\nSerangoon Sport Centre: SingPost (POPStation)\n\nWoodlands Sport Centre: Citrus By The Pool, SingPost (POPStation)\n\nYio Chu Kang Sport Centre: MindChamps Pre-school, SingPost (POPStation)\n\nActiveSG Hockey Village@Boon Lay: Little Explorers' Cove\n\n\nSingapore Derby postponed to later date\nThe Singapore Turf Club will postpone the $1 million Singapore Derby, which was originally scheduled for 18 April, with the new date to be announced later.\nThe race is one of the oldest feature races on the Singapore racing calendar, and is the final leg of the Four-Year-Old Challenge series. It is the second-richest race in Singapore, after the $1.5 million Kranji Mile, which is scheduled for 23 May.\nVeteran official appointed as Asian representative\nThe Singapore Disability Sports Council announced that veteran official Arthur Lee, 73, has been appointed the Asian representative to the swim committee at Virtus: World Intellectual Impairment Sport. This is the first time a Singaporean has been appointed for this role.\nLee will be serving a three-year term, and will help the committee manage competition programmes to promote sports for athletes with intellectual impairment.\nWith over 30 years of officiating expertise under his belt, Lee has been a strong advocate of inclusion and professionalism in Singapore swimming meets. He volunteered as a technical official and officiated his first National Swimming Championships in 1995. Since then, more than 30 other technical officials in Singapore have been trained by Lee to officiate para swimming meets.\n\n\nHave a sports event to tell our users? Email us at sgnews.tips@verizonmedia.com. In your email, do provide as many details as possible, including videos and photos."}
{"id": "74198963", "timestamp": "2020-04-05 23:58:31+00:00", "source": "straitstimes.com", "title": "Ecuador city runs out of coffins amid coronavirus crisis", "body": "QUITO (AFP) - Soaring numbers of coronavirus deaths in Ecuador's second city Guayaquil have led to a shortage of coffins, forcing locals to resort to using cardboard boxes, city authorities said on Sunday (April 5).\n\nAuthorities in the Pacific port city said they had received a donation of 1,000 pressed cardboard caskets from local producers, and delivered them for use in two local cemeteries.\n\n\"It's so they can meet demand,\" a city hall spokesman told AFP. \"There are either no coffins in the city or they are extremely expensive.\"\n\nBusinessman Santiago Olivares, who owns a chain of funeral homes, said his company was unable to keep up with demand.\n\n\"I sold the 40 that I had at the downtown branch, and 40 others from my headquarters. I had to order 10 more at the weekend and they've run out,\" Olivares told AFP.\n\nThe cheapest coffins currently cost around $400.\n\nOlivares said a 15-hour curfew in the city was contributing to the shortage of basic raw materials for coffin makers like wood and metal.\n\nLast week, residents posted videos on social media showing abandoned bodies in the streets in the Latin American city worst hit by the pandemic.\n\nThe government called in troops to pick up 150 corpses from streets and homes earlier this week after mortuary workers in the city were unable to keep up with a backlog of removals.\n\nThe cardboard coffins \"will be a great help in providing a dignified burial for people who died during this health emergency,\" the Guayaquil mayor's office wrote on Twitter.\n\nEcuador reported 3,646 cases of the coronavirus on Sunday, including 180 deaths, the majority of them occurring in Guayaquil and its surrounding province of Guayas."}
{"id": "74198957", "timestamp": "2020-04-05 23:57:57+00:00", "source": "cbsnews.com", "title": "Why John Dickerson wrote about acknowledging each other's grief as the coronavirus takes its toll", "body": "Amid the confusion and anxiety of coronavirus news, John Dickerson wants people to take time to acknowledge what has been lost. For an increasing number of Americans, that means a loved one.\n\nBehind the growing numbers of people who have died from COVID-19, there are friends and family members in mourning. Recently, Dickerson saw that sorrow up close when he spoke to a friend whose close family member died from the virus. He also saw the disconnect between what that family felt and the broader political debate occurring about the coronavirus.\n\nTo make sense of that clash, he wrote about it in an article for The Atlantic.\n\n\"The response has been pretty powerful, from all sorts of different people,\" Dickerson told 60 Minutes Overtime. \"And so a lot of people when they read it, passed it around, either because they were experiencing grief, or because they knew somebody that was, or because they were having a kind of anticipatory grief and sorrow about this confusing moment that we're all in.\"\n\nPart of what makes this moment so confusing, Dickerson said, is that people can no longer do what they usually do when a loved one dies. Due to social distancing and mandates against gatherings, they cannot have a funeral, nor hug relatives who have gathered. In most instances, they are not even able to be with their loved one in person before they die, especially if its due to COVID-19.\n\n\"All of the normal coping mechanisms are taken away,\" Dickerson said. \"And that is an acute situation for the people going through it, but also for the rest of us. This is something new for all of us to be experiencing this at the same time.\"\n\nFor Dickerson, that sense of unity in grief is what will help people get through it. He pointed to the collective applause that New Yorkers give at 7 pm each evening in thanks to health care workers who are taking care of the sick. The sounds of clapping hands and banging pots, he said, goes beyond the intended message.\n\n\"It's also all of us neighbors hearing each other, participating in that together, all having the same human reaction, regardless of our politics or our creed or our religions or races or where we come from, that we're all expressing the same kind of gratitude at the same time,\" he said, \"which is not only a good thing to be doing collectively, but it also reminds us all that we, at the very basic level, are all human beings.\"\n\nThe video above was produced by Brit McCandless Farmer and Sarah Shafer Prediger. It was edited by Sarah Shafer Prediger."}
{"id": "74198954", "timestamp": "2020-04-05 23:57:53+00:00", "source": "news.com.au", "title": "Tiger tests positive for coronavirus at NYC’s Bronx Zoo", "body": "A tiger at the Bronx Zoo has tested positive for the new coronavirus in what is believed to be the first known infection in an animal in the US or a tiger anywhere, federal officials and the zoo said Sunday. \nThe four-year-old Malayan tiger named Nadia – and six other tigers and lions that have also fallen ill – are believed to have been infected by a zoo employee who wasn’t yet showing symptoms, the zoo said. The first animal started showing symptoms on March 27, and all are doing well and expected to recover, a zoo spokesman said. The zoo has been closed to the public since March 16 amid the surging coronavirus outbreak in New York.\n“These are extremely hard days for all of us – no matter where we live and work. We will ensure that whatever we can learn from these circumstances will be used to better understand and combat this disease,” zoo director Jim Breheny said in a statement.\nThe finding raises new questions about transmission of the virus in animals. The US Department of Agriculture, which confirmed Nadia’s test result at its veterinary lab, says there are no known cases of the virus in US pets or livestock.\n“There doesn’t appear to be, at this time, any evidence that suggests that the animals can spread the virus to people or that they can be a source of the infection in the United States,” Dr Jane Rooney, a veterinarian and a USDA official, said in an interview.\nA USDA spokesperson said on Sunday it was not recommending routine coronavirus testing of animals in zoos or elsewhere or of zoo employees. Still, DR Rooney said a small number of animals in the US had been tested through the USDA’s National Veterinary Services Laboratories, and all those tests came back negative except Nadia’s.\nThe coronavirus outbreaks around the world are driven by person-to-person transmission, experts say.\nThere have been a handful of reports outside the US of pet dogs or cats becoming infected after close contact with contagious people, including a Hong Kong dog that tested positive for a low level of the pathogen in February and early March. Hong Kong agriculture authorities concluded that pet dogs and cats couldn’t pass the virus to human beings but could test positive if exposed by their owners.\nSome researchers have been trying to understand the susceptibility of different animal species to the virus and to determine how it spreads among animals, according to the Paris-based World Organisation for Animal Health. The American Veterinary Medical Association and the federal Centres for Disease Control and Prevention have been recommending that out of an abundance of caution, people ill with the coronavirus should limit contact with animals – advice that the veterinary group reiterated after learning of the tiger’s test result.\nIn general, the CDC also advises people to wash their hands after handling animals and do other things to keep pets and their homes clean. At the Bronx Zoo, Nadia, her sister Azul, two Amur tigers and three African lions developed dry coughs, and some of the cats exhibited some wheezing and loss of appetite, said Dr Paul Calle, the zoo’s chief veterinarian.\nOnly Nadia was tested because it takes anaesthesia to get a sample from a big cat. Her temperature was taken at the same time, and it was normal, Dr Calle said. The seven sickened cats live in two areas at the zoo, and the animals had contact with the same worker, who is doing OK, zoo officials said. They said they are taking “appropriate preventive measures” for the staffers who care for the ailing animals, and there are no signs of illness in other big cats on the property.\nFor most people, the coronavirus causes mild or moderate symptoms, such as a fever and cough that clear up in two to three weeks. For some, especially older adults, it can cause more severe illness, including pneumonia, and can be fatal."}
{"id": "74198955", "timestamp": "2020-04-05 23:57:52+00:00", "source": "news.com.au", "title": "Coles launches its own $80 groceries box to rival Woolworths", "body": "Coles has launched a Community Box that it will deliver to its vulnerable customers who have been most impacted by coronavirus and panic buying. \nThe supermarket giant will deliver a range of non-perishable basics for $80, the same price Woolworths charges for its Basics Box.\n“As part of our commitment to helping those most in need during this challenging time, we’ve created the Coles Community Box,” a Coles spokesperson said.\n“Delivered direct to homes in two packages by Australia Post, the Coles Community Box contains grocery items and household items for healthy meals and snacks, plus some everyday essentials.”\nRELATED: Follow the latest coronavirus updates\nColes' box contains a range of pantry samples including long-life milk, tea or instant coffee, cereal, baked beans, pasta and wraps.\nThe Community Box will be only available to Coles' priority service customers as “our priority right now is helping our most vulnerable customers and giving them access to grocery items and everyday essentials”.\nThose who are eligible for Coles' priority service are those over the age of 65, indigenous Australians over the age of 50 as well as aged and disability care businesses.\nColes has been forced to limit its home delivery to just those who are “in genuine need” as well as pausing its click and collect services, meaning customers can no longer pick up their pre-purchased supermarkets in store.\nWOOLIES BOX DIVIDES SHOPPERS\nLast week Woolworths launched its own version, an $80 Basics Box that is available for any customer who is unable to visit the supermarket.\nThe $80 box includes contactless doorstep delivery by Australia Post within an estimated time of two to five business days of order.\nCustomers can’t switch, change or choose items within the box, with Woolies explaining that streamlining the picking process is part of ensuring customers get the essential items as quickly as possible.\nHowever, the box has divided shoppers, with some slamming its contents in a post in Facebook group Budgeting, Food, Savings Ideas, Life Help Australia on Friday.\n\"Wow. Not even bread?\" one person wrote, while another claimed it was “overpriced for what you get”.\nRELATED: Science behind Aussie toilet paper frenzy\n“Does seem a bit of a rip-off for the price tag, is there some items missing?” one person commented.\nHowever, others argued the box was “better than nothing” and the point of it was to provide “non-perishable staples” to the vulnerable.\nIn response, Woolworths told news.com.au it had developed the Basics Box to “meet an essential community need” and the supermarket “will be making no profit from it”.\n“While it’s a far cry from a fully customised home delivery, it’s a good value offer covering the basics,” the spokesman said.\n“The price includes delivery to the door and helps cover costs associated with the picking, packing and transport of goods.\n“By streamlining the mix of products and partnering with Australia Post and DHL, we’re able to get more food to more vulnerable customers much faster.\n“We continue to work hard behind the scenes to ramp up our home delivery capacity for the benefit of priority assist customers.”"}
{"id": "74198940", "timestamp": "2020-04-05 23:57:29+00:00", "source": "dailycaller.com", "title": "‘I Felt A Real Pain In My Heart For My Country’: David Benham Arrested Outside NC Abortion Clinic Over Coronavirus Orders", "body": "Police arrested David Benham on Saturday, saying he defied North Carolina’s coronavirus stay-at-home orders.\n Benham and his sons were supporting pro-life sidewalk counselors who offer counseling to “at-risk mothers and babies” heading in and out of Preferred Women’s Health Center. \n “You know I am well within my constitutional authority to be here,” Benham said as he was handcuffed, a video showed. “You know that we are doing the right thing.”\n \nPolice arrested David Benham and his son Saturday for violating coronavirus distancing orders while offering sidewalk counseling outside a North Carolina abortion clinic — an incident he said was targeted.\n Benham, who started the pro-life sidewalk counseling service Cities4Life in 2010, told the Daily Caller News Foundation he received a call from some of the sidewalk counselors Saturday morning saying there were police outside Preferred Women’s Health Center in Charlotte, North Carolina.\n \n Benham is a Christian entrepreneur and former professional baseball player who gained media attention after he and his brother Jason Benham’s reality HGTV show was canceled over the brothers’ religious views.\n Three members of Cities4Life were at the clinic offering counseling Saturday, according to Benham, who said he drove to the clinic with two of his sons after hearing about the police.\n “We are a federally recognized 501(c)(3) public charity,” he told the DCNF of Cities4Life. “We are an essential business. We have both a local ordinance, a stay in shelter local ordinance, and a stay in shelter state ordinance.”\n Cities4Life is a publicly recognized charity that provides essential social services — like an ABC store, he said.\n \n  North Carolina Gov. Roy Cooper on March 27 issued a stay-at-home order in place until April 29, prohibiting gatherings of 10 or more people and directing North Carolinians to stay at home except for essential activities or businesses, such as grocery shopping, outdoor activity, taking care of others, and working at essential businesses like hospitals.\n Local outlets reported that police said there were about 50 people protesting at the clinic, but Benham said that information is inaccurate. Cities4Life had three members present at the clinic and a mobile ultrasound unit attended by two members, according to Benham, while about 15 police officers were at the scene. (RELATED: ‘Hail Satan’: Students Met With Public Masturbation, Glass Hurled, As They Pray Outside Abortion Clinic)\n “By the time they took me away, there were individuals that came and showed up,” he said. “But there was no organized groups of people. The Charlotte-Mecklenburg Police Department said there was a cluster, that there were 50 protesters. And of course, none of that is true.”\n Video footage from the incident showed Benham telling a police officer that he and Cities4Life are within their rights to stand outside the clinic, adding that they are practicing social distancing and standing six feet apart.\n \n WATCH:\n    David Benham Unlawfully Arrested\n Saturday morning David Benham was unlawfully arrested. Many have labeled him a fake Christian and claimed that he was endangering lives by being out today. This couldn't be further from the truth. David practiced social distancing and exercised every necessary precaution in light of COVID-19. Thank you for all the prayer and support so far. See the whole story in this video.\n Posted by Benham Brothers on Saturday, April 4, 2020\n \n “We are practicing social distancing, we have cleaned our hands, we are offering help to these mothers,” Benham told the police officers in the video.\n He told the DCNF that Cities4Life took multiple precautions against the virus, including drawing on the sidewalk to mark appropriate distances for the sidewalk counselors.\n He continued: “And if you are saying that we don’t have the right to be here, then go in the abortion clinic and make the arrests there.”\n “I don’t have the authority to go in the abortion clinic,” the police officer said. (RELATED: World Health Organization: Abortion Is ‘Essential’ During Coronavirus Pandemic)\n “So you don’t have the authority to go into the abortion clinic, but you have the authority to bully us and our sidewalk counselors?” Benham asked the officer.\n “I’m not budging,” he added. “And our sidewalk counselors are not budging.”\n “You know I am well within my constitutional authority to be here,” Benham said, as he was handcuffed. “You know that we are doing the right thing.”\n The video footage showed Benham telling the officers that he and the other sidewalk counselors are acting within their constitutional rights to be there, and that the group is a recognized charity “offering essential services” within the law to assist women in at-risk situations.\n “I’m actually thankful that when I got tapped on the shoulder, I didn’t even hesitate and just did it,” Benham told the DCNF of his arrest. “Then I felt courage inside of me and I felt a real pain in my heart for my country, and I felt a real threat to my children’s future.”\n “And you’ll see on the video, when they cuffed me, I said something and I almost burst out crying. I swallowed it back because I was just hit with such emotion that I can’t believe my country is doing this. I can’t believe these officers,” he said. “And it wasn’t the officers. It’s whoever’s instructing the officers. I can’t believe we’ve gotten to this point where we’re going to use a national healthcare emergency, a global healthcare emergency and global healthcare crisis to grab on unlimited power of the government and steal constitutional rights from pro-life Christians.”\n Benham was booked and released four hours later, he said, with an upcoming court date of June 2. He and seven others were charged with Violation of Emergency Prohibitions and Restrictions, according to WBTV.\n “I was already in jail — just the holding tank — for about an hour. And then all of a sudden I look up and boom, here comes my 20-year-old with cuffs on,” Benham said.\n “I said, ‘What on earth happened?’ He was like, ‘Well, you know, I wasn’t even standing around anyone and they told me I had to leave and there wasn’t even 10 people there.’ And so I was like, ‘Well, I might as well go down and like my dad.'”\n Benham said the incident showed “viewpoint discrimination” from the mayor of Charlotte, the city council members of Charlotte, and the city attorney of Charlotte.\n “They’ve been after us for years,” he said. “Against conservative voices.”\n “So once this coven crisis hit, this was their opportunity for a power grab,” he added.\n Benham pointed the DCNF toward a March 28 tweet from Charlotte City Councilwoman Julie Eiselt in which she asked police to shut down pro-life activity at an abortion clinic. Eiselt, who did not respond to a request for comment from the DCNF, noted in another tweet that pro-lifers had been protesting at a Planned Parenthood clinic.\n  Neither Charlotte Mayor Vi Lyles nor the Charlotte-Mecklenburg Police Department replied to multiple requests for comment from the DCNF. (RELATED: Texas Governor Deems Religious Services Essential As Police Arrest Southern Pastors For Holding Sunday Services)\n Benham noted that the police understood “very clearly” that Cities4Life had the right to be at the clinic.\n “They had one of their officers on the phone with their attorney,” he said. “And so every argument I was making, they would then make that argument to their attorney and then come back with what they were trying to say. And every time we just twisted them right up and said, ‘Nope, Nope. Doesn’t work. Here’s why.'”\n “They should have never made that arrest,” he added. “They should’ve never done it. But they did.”\n Republican Texas Sen. Ted Cruz defended Benham in a Saturday tweet, calling the arrest “unconstitutional.”\n “My friend David Benham was unconstitutionally arrested today in NC for peacefully providing pregnancy counseling outside an abortion clinic. If NC deems abortion “essential,” then pregnancy care services are as well. This is WRONG; Governor Cooper should be ashamed,” he tweeted.\n “This is an unconstitutional arrest,” Cruz added in another tweet. “@BenhamBrothers exercising core First Amendment rights. PEACEFULLY. In a way fully consistent w/ public safety. Because elected Dems are pro-abortion, they are abusing their power—in a one-sided way—to silence pregnancy counselors.”\n Both Live Action and Live Action’s president Lila Rose weighed in on the matter as well.\n  “It is DESPICABLE  unconstitutional for pro-abortion bureaucrats to order the arrest of peaceful Americans who pray  offer hope outside abortion facilities, all while allowing the lethal abortion industry to continue killing innocent children during a pandemic,” Rose tweeted. \n Content created by The Daily Caller News Foundation is available without charge to any eligible news publisher that can provide a large audience. For licensing opportunities of our original content, please contact licensing@dailycallernewsfoundation.org."}
{"id": "74198931", "timestamp": "2020-04-05 23:57:25+00:00", "source": "urdupoint.com", "title": "Trump Says Nearly 1.7Mln US Citizens Underwent Tests For Coronavirus", "body": "WASHINGTON (UrduPoint News / Sputnik - 06th April, 2020) As many as almost 1.7 million people in the US have been tested for COVID-19, US President Donald Trump told reporters at the White House Coronavirus Task Force briefing on Sunday.\n\"We've done 1.67 million tests, and we have a great system now,\" Trump told reporters.\nThe US president added that the overall situation was getting slightly better.\n\"We see the light at the end of the tunnel. ... Hopefully, in the not-too-distant future we will be proud of the job we all did,\" Trump noted.\nNew York, which has been the most impacted state by COVID-19, for the first time in a week reported fewer deaths from previous days, although there were 600 new fatal cases.\n\"Maybe that's a good sign,\" Trump commented.\nOver 331,000 coronavirus cases have been confirmed in the United States, which is the largest number of cases among all countries. The US death toll from the viral infection is the third largest, it is surpassed only by Italy (over 15,880 deaths) and Spain (more than 12,400 deaths).\nJohns Hopkins University data at 13:30 GMT on Sunday showed that the total number of confirmed coronavirus cases in the US was 312,249 including over 8,500 fatalities."}
{"id": "74198932", "timestamp": "2020-04-05 23:57:25+00:00", "source": "urdupoint.com", "title": "Coronavirus Cases In US Showing Leveling Trend Across All US States - Pence", "body": "WASHINGTON (UrduPoint News / Sputnik - 06th April, 2020) US Vice President Mike Pence says that there is a trend of leveling in the number of COVID-19 cases across all US states.\n\"New cases were down slightly,\" Pence said at the Sunday White House Coronavirus Task Force press briefing, adding that a \"leveling\" trend was reported by all the state governors he talked to.\nPence stressed that, as Trump said earlier at the briefing, there was \"light at the end of the tunnel.\" \"We'll get through this a lot sooner than we first thought it would take,\" the vice president said.\nAccording to the Johns Hopkins University's Coronavirus Resource Center, there are over 335,500 confirmed coronavirus cases in the US, which is the largest number of COVID-19 cases of all countries.\n The United States has the third largest death toll from COVID-19 in the world (over 9,500 fatalities), it is surpassed only by Italy (over 15,880 deaths) and Spain (more than 12,600 deaths). The city of New York alone has registered over 2,250 deaths from COVID-19.\nTrump said during a White House press briefing on Saturday that the number of COVID-19 deaths would be on the rise in the following two weeks."}
{"id": "74198922", "timestamp": "2020-04-05 23:56:41+00:00", "source": "dailymail.co.uk", "title": "Lucy Hale dons a face mask while running errands in Los Angeles", "body": "As the novel coronavirus, COVID-19, continues to see rises in cases and deaths around the country, the Centers for Disease Control has implemented a new recommendation for people to wear face masks during any time in public.\n\nAnd Lucy Hale seems to be following the new suggestion as she was spotted in a face mask while running errands in Los Angeles on Sunday.\n\nThe 30-year-old star looked casual for her outing in green metallic workout leggings paired with a black bomber jacket.\n\nHer black jacket had a large rose embroidered on the back and she paired the look with a dark grey plain tee and black and grey lace-up sneakers.\n\nKeeping her hands free she had a crossbody bag, with a light brown leather strap, across her chest.\n\nThe former Pretty Little Liars star covered the rest of her face with dark metal frame sunglasses.\n\nHer signature brunette locks were pulled back, and out of her face, into a low ponytail as she was spotted getting into her white Mercedes SUV.\n\nThe animal lover took to Twitter on Thursday in support of the American Society for the Prevention of Cruelty to Animals.\n\n'An organization I absolutely adore - @ASPCA - is urgently seeking donations for their COVID-19 Relief & Recovery Initiative to help pets, pet owners, and animal welfare organizations!! Please consider supporting their lifesaving efforts,' she tweeted for her roughly 7.1 million followers along with a link to the organization's emergency relief fund.\n\nLucy has been portraying title character Katy Keene in The CW spin-off of Riverdale since its premiere in February.\n\nThe Tennessee native rose to fame portraying Aria Montgomery in the Freeform series Pretty Little Liars from 2010 to 2017.\n\nLucy had a starring role in the Fantasy Island supernatural horror film that was released on February 14 in theaters.\n\nThe prequel to the 1977 ABC television series earned $48 million worldwide against a production budget of $7 million.\n\nLucy currently has three films in post-production: A Nice Girl Like You, Son Of The South and Big Gold Brick.\n\nShe also is a co-producer of A Nice Girl Like You, which is based on the 2007 popular memoir Pornology by Ayn Carrillo-Gailey."}
{"id": "74198925", "timestamp": "2020-04-05 23:56:41+00:00", "source": "sportskeeda.com", "title": "New WWE NXT Women's Champion crowned at WrestleMania 36 tonight", "body": "New WWE NXT Women's Champion crowned at WrestleMania 36 tonight\n\n\nCharlotte Flair won her second NXT Championship tonight.\n\nFans are already calling the match one of the best of the weekend.\n\n\n\n\n\n\n\n\n\nNews            \n\n\n\nModified 06 Apr 2020, 05:23 IST\n\n\n\n\n\n\n\n\n\n          Ripley vs Flair at WrestleMania 36Following what was an incredible match between the two at WrestleMania 36, Charlotte Flair defeated Rhea Ripley to win her second NXT Women's Championship.\n'The Queen' spent most of the match working on Ripley's left knee, and while the 'Nightmare' certainly held her own during the bout, it wasn't enough. Flair won the hard-fought battle following a Figure Eight leglock.\n          Image courtesy of WWE This was the opening match on the second night of a two night WrestleMania that has had to improvise left and right due to the lockdowns caused by the current COVID-19 pandemic. This is the reason that tonight's matches have been prerecorded and held in an empty WWE Performance Center - save for a few exceptions like the Boneyard and Firefly Fun House match.\nThat  being said, Ripley vs Flair was an incredibly well-performed match, with both Superstars attempting to put on a show worthy of a stadium of screaming fans. And that they did, with the majority of opinion expressed on social media sites like Twitter and Facebook expression their joy with the fight, and already calling it one of the best matches of the two nights so far.\nIn the meantime, we'll have to wait and see what kind of impression Flair makes on NXT now that she's the black and gold brand's reigning women's champion.\n\nPublished 06 Apr 2020, 05:23 IST\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nFetching more content..."}
{"id": "74198823", "timestamp": "2020-04-05 23:56:26+00:00", "source": "stuff.co.nz", "title": "Coronavirus: 'Traumatised' tourist driver sentenced over fatal crash", "body": "Melanie Giesinger, 28, was fined and disqualified from driving after causing the death of motorcyclist Tane Roderick in a crash near Moeraki on Waitangi Day.\n\nA grieving mother says the tourist driver who killed her son \"may not be in jail, but boy she's getting punished\".\n\nMelanie Giesinger, a teacher from Austria, appeared for sentencing behind closed doors in the Auckland District Court on Friday after killing Kiwi motorcyclist Tane Roderick in a crash in Otago on Waitangi Day.\n\nRoderick's family, including his Invercargill-based mother Sally Wast, were able to take part in the sentencing via audio visual link, or telephone.\n\nRoderick, 42, died when the campervan Giesinger was driving pulled out in front of his motorcycle near Moeraki, south of Oamaru, on February 6.\n\nREAD MORE:\n\n * Mum of motorcyclist killed in Moeraki crash says tourist drivers should sit test \n\n * Coronavirus: German teenager sets sights on a mercy flight\n\n * Stranded tourists try to charter planes to catch international mercy flights\n\n * Coronavirus: US lobbying for its citizens to be allowed to get to Auckland to fly home\n\nGiesinger, 28, pleaded guilty in February, but her counsel sought a discharge without conviction, delaying her sentencing until April.\n\nThe rescheduled sentencing was going to be held in Dunedin on Wednesday, but was brought forward under urgency due to concerns about Covid-19.\n\nGiesinger's travelling companions returned to Austria in February, leaving her to face the sentencing alone.\n\nHer isolation, coupled with New Zealand's coronavirus lockdown and Roderick's death, had left her \"traumatised\", Wast said.\n\n\"Mentally it is going to weigh on her the rest of her life. I think she's been punished enough.\"\n\nIt was unclear when Giesinger could return home, but \"she needs to be with her family\", Wast said.\n\n\"I do feel for her, being here on her own, that must be horrendous for her.\"\n\nGiesinger and Roderick's family met face-to-face at a restorative justice meeting after the last Dunedin court appearance.\n\nWast said the family were \"a pretty intimidating lot\" and Giesinger was obviously remorseful.\n\n\"She answered the questions we all asked ... after all it could have been any one of us driving that campervan. She just happened to be the one that day.\"\n\nWast said she continued to grieve for her son and his death served as a reminder that \"you never know when your number is up\".\n\nRoderick, who had just celebrated his first wedding anniversary, was travelling to Invercargill for the Burt Munro Challenge Rally after visiting his uncle in Moeraki.\n\nThe police summary of facts said the Auckland man died instantly when Giesinger drove her campervan into his path.\n\nGiesinger told police she did not see him.\n\nWast said Giesinger was fined $4500 at Friday's sentencing, and ordered to pay reparation to Roderick's family. She was also disqualified from driving in New Zealand for 18 months.\n\nIt is unclear if Giesinger is able to return home to Austria, but her sentencing comes as neighbouring Germany helps hundreds of its citizens fly home."}
{"id": "74198787", "timestamp": "2020-04-05 23:55:57+00:00", "source": "usnews.com", "title": "Couples in Quarantine: Stress, Anxiety, Fear of the Unknown", "body": "With all the havoc it's wreaking across the globe, the coronavirus outbreak is naturally having an impact on couples and their relationships."}
{"id": "74198938", "timestamp": "2020-04-05 23:55:57+00:00", "source": "businessinsider.com", "title": "General Motors and Ventec are gearing up to make critically needed ventilators in Indiana to fight the coronavirus pandemic", "body": "On Friday, President Donald Trump used the Defense Production Act to direct General Motors to \"prioritize federal contracts\" for ventilators.GM confirmed that it's retooling a plant in Indiana to manufacture ventilators with Ventec Life Systems.The partnership could increase capacity to more than 10,000 ventilators per month; hospitals confront a critical shortage of ventilators as the COVID-19 coronavirus spreads across the US.GM also said that it would produce surgical masks at a plant in Michigan.Visit Business Insider's homepage for more stories.\n\n\n\nOn Friday, President Donald Trump signed a Presidential Memorandum directing the Secretary of Health and Human Services to use the Defense Production Act to \"accept, perform and prioritize federal contracts\" for ventilators.Trump's move comes after he railed against the automaker on Twitter over the production of the life-saving machines needed to assist medical professionals responding to the coronavirus pandemic.In a statement, the White House accused General Motors of \"wasting time\" and that their fight against the COVID-19 pandemic was too urgent to allow for the give-and-take of the contracting process.GM confirmed that it would build ventilators at a factory in Indiana, in partnership with Ventec Life Systems.The VOCSN critical-care ventilators are FDA-cleared and could begin shipping next month.\n\n\n\n\"Across all manufacturers, there is a global backorder of critical care ventilators capable of supporting patients fighting COVID-19,\" Ventec said in a statement.\"Depending on the needs of the federal government, Ventec and GM are poised to deliver the first ventilators next month and ramp up to a manufacturing capacity of more than 10,000 critical care ventilators per month with the infrastructure and capability to scale further.\"Some details about the use of the factory in Indiana were earlier reported by The New York Times.Ventec said that it would also expand manufacturing capacity at its Bothell, Washington, facility.GM and Ventec announced a partnership earlier this week. But on Friday, President Donald Trump attacked GM and CEO Mary Barra for a deal for FEMA to buy ventilators that reportedly fell through.\n\n\n\nThe companies said that efforts to retool the Kokomo, Indiana, plant, which normally supplies electrical components for vehicles, were underway \"around the clock.\"\n \n \n \n \n \n \n \n \n \n \n \n \n GM will also make surgical masks at a plant in Michigan.\n \n\n \n GM\n \n \n \"Depending on the needs of the federal government, Ventec and GM are poised to deliver the first ventilators next month and ramp up to a manufacturing capacity of more than 10,000 critical care ventilators per month with the infrastructure and capability to scale further,\" Ventec said.According to Ventec CEO Chris Kiple, \"This unique partnership combines Ventec's respiratory care expertise with GM's manufacturing might to produce sophisticated and high-quality critical care ventilators.\"\"This pandemic is unprecedented and so is the response, with incredible support from GM and their suppliers,\" he added. \"Healthcare professionals on the front lines deserve the best tools to treat patients and precision critical care ventilators like VOCSN are what is necessary to save lives.\"The companies said that work started last Friday, March 20, on an immediate plan to mass-produce ventilators, locating more than 700 parts required to assemble 200,000 ventilators.\n\n\n\n\"GM is in the position to help build more ventilators because of the remarkable performance of GM and Ventec's global supply base,\" added Barra. \"Our joint teams have moved mountains to find real solutions to save lives and fight the pandemic.\"GM also said that it would start making \"FDA-cleared Level 1 surgical masks at its Warren, Michigan manufacturing facility.\"Production starts next week and could create up to 100,000 masks."}
{"id": "74198875", "timestamp": "2020-04-05 23:55:54+00:00", "source": "indiatimes.com", "title": "26-year-old tests positive, cops say he is Tablighi attendee | Ludhiana News - Times of India", "body": "Ludhiana: A 26-year-old man from Rajgarh village, Payal block, tested positive for coronavirus on Saturday evening.“He is one of the 20 people who returned to Ludhiana after attending a religious congregation from March 13 to 15 at Tablighi Jamaat Markaz in Hazrat Nizamuddin, Delhi,” stated the additional director general of police in a letter to deputy commissioner Pradeep Agrawal, commissioner of police Rakesh Agrawal and senior superintendent of police (rural) Vivek Sheel Soni on April 1.With this, positive cases in Ludhiana district have reached six. Civil surgeon Dr Rajesh Bagga said, “On Saturday, 46 samples were sent, one tested positive and the report of another is pending. The source of infection is yet to be traced.”“He had travelled outside Punjab and we are tracking it. We have taken the samples of his family and admitted him to the civil hospital isolation ward late on Saturday night. We will also trace his contacts.”The 26-year-old told the TOI that he visited Guntur district, Vijayawada, Hyderabad, from March 16 to 23 and stayed at an acquaintance’s house there. On March 23, he took a flight from Hyderabad to Delhi and returned to Ludhiana the next day.He denied attending Tablighi Jamaat in Delhi.The deputy commissioner said, “The health department is keeping a check on his family. His locality has been sealed and police force deployed there.”SSP (rural) Harpreet Singh, “His call records show that he was in Ludhiana from March 13 to 15. He had gone to Hyderabad on March 16. He was in Delhi on March 23 and came back to Ludhiana on March 24.”Apart from him, five women have tested positive for Covid-19 till now. They had no foreign travel history. The first was a 55-year-old from Gurdev Nagar who tested positive on March 24 and was admitted to Dayanand Medical College and Hospital. On Sunday, her throat swab was again sent to Rajindra Hospital, Patiala. The second patient is a 72-year-old Jalandhar woman admitted to Christian Medical College and Hospital. Her condition is stated to be stable. The third patient, a 42-year-old woman from Amarpura Mohalla, was referred to Rajindra Hospital on March 30. She died the next day. Her 72-year-old neighbour is the fourth case. The fifth case is a 69-year-old woman from Shimlapuri. She too has succumbed to coronavirus.‘Admitted, tested, discharged, picked up next day again’The 26-year-old said, “The health department picked me up from my house on the evening of April 2 and admitted me to the civil hospital isolation ward. They took my throat swab and didn’t serve me dinner. I was told that my report will be out the next day. When I inquired that day, they said it will come on April 4. On April 4 morning when I asked them, they said I tested negative and I was released at 11.30am.”“I requested the health department to drop me home in an ambulance, as it was difficult to get a transport in the curfew. But they refused. I then walked till Dholewal Chowk, from where my father picked me up,” he added.On April 4 night, health department officials called him up and said they were coming to handover to him his reports. “When they came, they said I had tested positive and that they had come to pick me up. I have no symptoms like cough and fever. I am perfectly fine. I didn’t go out during the lockdown.”On whether he attended the Islamic congregation in Delhi, he said, “I never went there. On March 16, I had gone to Delhi by Shan-e-Punjab Express. From there the next day, I boarded Vijayawada Express to reach Hyderabad.”He lives with his parents, two sisters, wife and two sons. They have been admitted civil hospital isolation ward.Balbir Singh Sidhu, health and family welfare minister, said, “An inquiry will be marked against those who discharged the patient. Patients will now be told about their report status.”"}
{"id": "74198877", "timestamp": "2020-04-05 23:55:54+00:00", "source": "indiatimes.com", "title": "69-yr-old Shimlapuri woman is second casualty from city | Ludhiana News - Times of India", "body": "Ludhiana: A 69-year-old woman from Shimlapuri with no contact history with a Covid-19 patient became the second casualty in Ludhiana on Sunday, a day when the number of confirmed cases in the district rose to six.The woman was admitted to Fortis Hospital here at 10.09pm on March 31 and she breathed her last in its isolation ward at 2.30pm on Sunday. She had tested positive on April 2. She had stayed with her niece in Mohali from March 17 to March 31 and had commuted there by a bus. However, she had started showing symptoms of cough and breathlessness from March 23. Eight days later, she took an ambulance from Mohali all alone and got herself admitted to Fortis Hospital, Ludhiana.Ludhiana civil surgeon Dr Rajesh Bagga said the condition of the woman deteriorated around 2pm. She had a cardiac arrest and passed away at 2.30pm after cardiopulmonary resuscitation (CPR). Fortis Hospital medical superintendent Dr Shelly Deora told the TOI, “We could not revive her after cardiac arrest.”The woman’s daughter-in-law said, “She was fine when she was admitted on March 31. Then she had diarrhoea, but was having proper meals till April 1. But on April 2, she developed acute respiratory issues and was put on a non-invasive ventilator. However, in the past two days her health deteriorated and she was put on a ventilator.”Ludhiana health authorities have sealed her locality in the densely-populated Shimlapuri. “No one is coming forward to claim her body due to fear psychosis,” said sources in health department.Dr Shelly said, “I called up the additional deputy commissioner, the sub-divisional magistrate, SHOs and the health department. They said we have to take the body to the cremation ground. It’s been more than three hours that the body has been sanitised and zipped up, but family is not ready to come to the cremation ground.”SDM (west) Amrinder Singh Malhi said, “We are coordinating and have tied up with nodal officer Dr Ramesh Bhagat. Her relatives are in panic and do not want to attend the cremation. We will help the family in cremating the body with the support of police officials.”However, a member of her family said, “We do not know how the body will be taken to the cremation ground.”Later, she was cremated at a ground in Dana Mandi.Earlier, a 42-year-old woman from Amarpura Mohalla was referred to Rajindra Hospital, Patiala, on March 30 and she died the next day. The body was sent to Ludhiana in accordance with health department guidelines.--Tracking the casesSuspected cases till date | 329Samples sent on Sunday | 51Positive cases till date | 6 (5 from Ludhiana and 1 from Jalandhar)Deaths reported | 2Patients who tested negative till date | 270Results awaited | 51Patients screened on Sunday | 334Home quarantined on Sunday | 164"}
{"id": "74198919", "timestamp": "2020-04-05 23:55:53+00:00", "source": "yahoo.com", "title": "Gilead To Donate 1.5M Doses Of Experimental Coronavirus Treatment: 'The Right Thing To Do'", "body": "Gilead Sciences, Inc. (NASDAQ: GILD) is donating 1.5 million doses of remdesivir, its investigational drug for COVID-19, for compassionate use, expanded access and clinical trials, Chairman and CEO Daniel O'Day said Saturday. \nThe doses are intended for patients with severe symptoms who will receive them intravenously on a daily basis in a hospital setting, the CEO said in a letter posted on Gilead's website. \nThe 1.5 million doses could amount to more than 140,000 treatment courses in COVID-19 patients, depending on the duration of treatment, he said. \nThe antiviral drug was first developed by Gilead as a potential treatment for the Ebola and Marburg viruses. Multiple clinical trials for the drug are underway in COVID-19 with thousands of patients worldwide participating, the company's CEO said Saturday. \nThe drug is investigational and unapproved, and its safety and efficacy are not yet known, according to Gilead.\n\"Having a potential treatment in our hands comes with significant responsibility,\" O'Day said. \n\"Providing our existing supplies at no charge is the right thing to do, to facilitate access to patients as quickly as possible and in recognition of the public emergency posed by this pandemic.\"\nBenzinga is covering every angle of how the coronavirus affects the financial world. For daily updates, sign up for our coronavirus newsletter.\nGilead Sets Goal Of Producing 1M More Remdesivir Doses This Year\nAs of Sunday, there are 1,252,265 confirmed coronavirus cases globally and 68,147 deaths, according to Johns Hopkins University data. 238,675 people have recovered from the virus, according to the university. \nOver 1,700 patients have been treated programs where Gilead has provided remdesivir on a compassionate use basis for children and pregnant women, O'Day said. \nThe company has set a goal of producing more than 500,000 remdesivir treatment courses by October and 1 million by the end of 2020.\nThe production of the drug requires specialized chemistry, multiple chemical reactions, scarce raw materials and sterile manufacturing capabilities, the CEO said. Gilead has managed to cut the end-to-end manufacturing timeline for remdesivir from about one year to roughly six months, he said. \nSee more from Benzinga\n© 2020 Benzinga.com. Benzinga does not provide investment advice. All rights reserved."}
{"id": "74198855", "timestamp": "2020-04-05 23:55:52+00:00", "source": "abc.net.au", "title": "Latest coronavirus cases in Tasmania linked to North West Regional Hospital", "body": "Two more cases of coronavirus in Tasmania have been linked to an outbreak at a hospital in the state's north-west, the Premier has confirmed.\n\nThe cases were announced on Sunday night, but Premier Peter Gutwein only confirmed they were linked to the hospital on Monday morning.\n\nThe two new cases include a health worker and a patient at the North West Regional Hospital (NWRH) in Burnie.\n\nThree other cases, all health workers, have previously been linked to the hospital.\n\nMr Gutwein said it was important residents in the north-west \"understand this is serious\" and said an outbreak investigation was underway to trace the sources of the infection.\n\nIn addition to the two new cases linked to the NWRH, the hospital's chief medical officer Tony Lawler said another patient in the Mersey Community Hospital in Latrobe near Devonport had tested positive for coronavirus after being transferred from the NWRH on April 2.\n\nAt the time of the transfer, the patient did not have coronavirus symptoms, Professor Lawler said.\n\nTasmania has 86 cases of COVID-19 in total.\n\nTwo other cases announced on Sunday were linked to travel on the Ruby Princess cruise ship and contact with a known COVID-19 case.\n\nForty have been in the south, 24 in the north, 19 in the north-west and three people from interstate who were diagnosed in Tasmania.\n\nMore to come."}
{"id": "74198939", "timestamp": "2020-04-05 23:55:51+00:00", "source": "foxnews.com", "title": "Celebrity livestreams you can watch while social distancing during the coronavirus pandemic", "body": "Here are some live streams by celebrities you can watch online as social distance indoors during the coronavirus pandemic.\n\n\n\n\nGet all the latest news on coronavirus and more delivered daily to your inbox. Sign up here.\nAs coronavirus has all but dried up releases in the worlds of music, movies and television, it's easy to become bored at home while quarantining.\nWhile streamers like Spotify and Netflix have nearly endless catalogs of content, some might be yearning for something a little different to keep their mind off of things.\nREESE WITHERSPOON SAYS SHE'S TRYING 'TO BE PATIENT' WITH FAMILY DURING CORONAVIRUS QUARANTINE\nLuckily, there are plenty of celebrity livestreams to keep fans occupied, whether they're looking for music, talk shows or something else.\n\n      Miley Cyrus is hosting a daily talk show on Instagram featuring celebrity guests.\n      (Photo by Presley Ann/WireImage)\n\n\nHere's a look at the livestreams airing during the coronavirus quarantine:\nBillboard's \"Live At-Home\" series, which can be streamed on Facebook, provides fans with live, 30-minute sets performed by the likes of Josh Groban, Lauren Jauregui, JoJo and more.\nDiplo offers livestreams of full DJ sets that he mixes in his living room. Fans can tune in on YouTube.\nMiley Cyrus has started a daily talk show called \"Bright Minded,\" which features all-star guests like Reese Witherspoon and Demi Lovato. Check out the show on her Instagram page.\nJADA PINKETT SMITH TALKS RELATIONSHIP-BALANCING AMID CORONAVIRUS PARANTINE: 'I NEED 2 HOURS, PLEASE'\nDeath Cab for Cutie's Ben Gibbard is streaming live from his home every day, playing hour-long sets. Watch them on the band's Facebook page.\nGlobal Citizen is offering a \"Together At Home\" series, featuring the likes of Jennifer Hudson, Chris Martin, John Legend and more, which can be streamed on the organization's Instagram.\nChristine and the Queens broadcasts concerts on Instagram every day.\n\n      Katherine McPhee and David Foster put on daily concerts from their home.\n      (Bennett Raglin/Getty Images for Breast Cancer Research Foundation, File)\n\n\nKatharine McPhee and her husband David Foster are putting on concerts every evening from their home, which can be seen on Instagram.\nFollow John Mayer on Instagram to get updates on his talk show, \"Current Mood.\"\nTalk show hosts like Jimmy Kimmel and Jimmy Fallon are offering monologues and interviews on YouTube.\nHOW MEGHAN MARKLE, PRINCE HARRY ARE SELF-ISOLATING: REPORT\n\"Live with Kelly and Ryan\" has gone remote, and can be watched on YouTube.\nChris Harrison, host of \"The Bachelor\" franchise, holds nightly \"Group Dates,\" where he and his girlfriend chat with former franchise contestants on Instagram.\n\n      Chris Harrison hosts a talk show on Instagram featuring contestants from \"The Bachelor\" franchise. (Photo by Paul Archuleta/Getty Images)\n      \n\n\nOn Thursday, March 26, TikTok will play host to EduTok, which will feature livestreams from Jessica Alba, Dr. Phil, Billy Nye and more to offer life advice, health tips and thoughtful conversations.\nCLICK HERE TO GET THE FOX NEWS APP\nOn Sunday, March 29, FOX will air a \"Living Room Concert for America,\" which will be hosted by Elton John and feature at-home performances from superstars like Tim McGraw, Mariah Carey, Billie Eilish and many, many more."}
{"id": "74198729", "timestamp": "2020-04-05 23:55:50+00:00", "source": "indiatimes.com", "title": "Sherpur colony residents ‘attack’ health dept team | Ludhiana News - Times of India", "body": "Times News NetworkLudhiana: Residents of a colony in Sherpur allegedly attacked a health department team when it went there to pick up a Covid-19 suspected case on Sunday afternoon.Sahnewal senior medical officer Dr Poonam Goyal said, “A health department team reached the colony after receiving information that its resident is a coronavirus suspected case and that he had come in contact with Tablighi Jamaat attendees. The team comprised two workers of 108 ambulance and three multipurpose health workers.”As soon as the team made the suspected case sit in the ambulance, a locality resident started making a video of it. When the team objected to it, the man began manhandling them. Later, other residents also joined him and attacked the team with sticks. They also tried to block the way of the ambulance, Goyal added.Ambulance driver Dilpreet Singh and health worker Gurdeep Singh have received minor injuries.A compliant has been lodged with Moti Nagar police.Moti Nagar police station additional SHO Surinder Singh said, “On receiving the information, we reached the spot. The team has got their medical examination conducted. An FIR will be lodged after recording their statements.”"}
{"id": "74198645", "timestamp": "2020-04-05 23:55:47+00:00", "source": "abc.net.au", "title": "Australia's coronavirus death toll hits 37 as numbers in NSW continue to rise", "body": "Australia's coronavirus death toll has doubled in the past week after two new fatalities in NSW took the national total to 37.\n\nNSW Health confirmed an 86-year-old man and a 85-year-old man with COVID-19 died yesterday.\n\nOn March 30 Australia had 17 confirmed coronavirus fatalities, but that number has swollen in the past week.\n\nThe increase is particularly pronounced in NSW, where there has been 18 COVID-19 deaths, including six in the past two days.\n\nNSW Health's executive director of protection Dr Jeremy McAnulty said the total number of new cases in the state was decreasing.\n\nIn the 24 hours to 8:00pm Sunday, there were 57 new coronavirus infections in NSW, taking the state's total to 2,637.\n\n\"The numbers we are seeing in the last few days have been really hopeful,\" Dr McAnulty said.\n\n\"It seems that the actions we are taking in terms of case finding and contact tracing have been working.\"\n\nEleven coronavirus deaths, and more than 600 cases, have been linked to the Ruby Princess cruise ship, which docked at Port Kembla this morning.\n\nNSW Police Commissioner Mick Fuller said there were 1,040 crew members from 50 different countries still on the ship.\n\nAbout a fifth of them have COVID-19 symptoms.\n\nYesterday, police announced a criminal probe to examine if the ship's operator, Carnival Australia, downplayed potential COVID-19 cases before it docked in Sydney last month.\n\nThe ship will get fresh supplies and everyone on board will be tested so healthy crew members can be repatriated.\n\nDr McAnulty said it was \"pleasing\" to see a drop in the latest infections figures in NSW, but noted there were fewer tests done at the weekend.\n\nThere have been more than 300,000 screenings for the virus done across the country.\n\nNSW Health said it was encouraging doctors and clinics to expand their COVID-19 testing in regions where there was evidence of local transmissions.\n\n\"So people with symptoms of acute respiratory infection, so cough, shortness of breath, sore throat or fever [should] go talk to their GP or go to a clinic for testing,\" Dr McAnulty said.\n\nHe said areas which NSW Health were looking to expand screening in Sydney included Ryde, Macquarie Park, Woollahra, Manly, Waverley and Dee Why.\n\nOutside Sydney, Dr McAnulty said testing should be increased in Byron, Lake Macquarie, Port Macquarie, Broken Hill and Nowra.\n\nLast week, a pop-up testing clinic was established at Bondi Beach after several backpackers were linked to an outbreak in Sydney's eastern suburbs."}
{"id": "74198647", "timestamp": "2020-04-05 23:55:47+00:00", "source": "indiatimes.com", "title": "State will use SC breather on border row to formulate effective response: MP | Mangaluru News - Times of India", "body": "Mangaluru: A direction from the Supreme Court to the Union health secretary on Friday, to hold consultations with her counterparts in Karnataka and Kerala to find a solution to the deadlock arising from Karnataka’s decision to close its borders and not allow people to enter from Kasaragod, will be heard on April 7, which has given Karnataka a breather for some time. The state will use this time to formulate its response, to negate a direction from the Kerala high court to the Centre in this regard.Asserting there are no issues in this regard till April 7, when the Supreme Court takes up the matter for further hearing, Dakshina Kannada MP Nalin Kumar Kateel said, “The status quo will continue till then. Karnataka will file one more affidavit before the apex court on that day, explaining reasons on why the borders between Karnataka and Kerala must remain sealed,” putting in context the record number of Covid-19 cases in that state.The Dakshina Kannada district administration is worried as neighbouring Kasaragod district has almost as many Covid-19 cases as is there in the whole of Karnataka.“We have no issues with Kerala in normal times. However, the Covid-19 pandemic has created an extreme situation, where allowing patients from Kasaragod into the city will put tremendous pressure on the existing health infrastructure, that should cater to the needs of people of the district,” Nalin surmised."}
{"id": "74198666", "timestamp": "2020-04-05 23:55:47+00:00", "source": "yahoo.com", "title": "Stock market news live updates: Stock futures rise as investors monitor coronavirus case counts", "body": "Stock futures rose Sunday evening as investors braced for another week of closely monitoring developments around the global coronavirus outbreak and policymakers’ responses to the pandemic.\nOver the weekend, new coronavirus cases continued to rise in major centers around the world, albeit at an at least temporarily slower pace than in recent weeks.\nThe state of New York, which leads the nation with about 122,000 positive cases, on Sunday reported 594 new coronavirus deaths, or a decrease from the 630 reported on Saturday. But Governor Andrew Cuomo in Sunday press briefing cautioned against conflating the state’s first reported decrease in both death and total case count with the start of a trend, and reiterated that the state health system remains strained with patients. Total fatalities in New York have topped 4,100 to date.\nElsewhere, Italy reported the slowest rise of new deaths in two weeks on Sunday. France and Spain – two other European centers for the virus – also reported a deceleration in new deaths. In Britain, where more than 47,000 people have been infected, Prime Minister Boris Johnson was admitted to a hospital for further testing 10 days after testing positive for the coronavirus.\nOfficial government guidance around controlling the spread of the coronavirus continues to be dynamic in the U.S., with the Centers for Disease Control and Prevention on Friday adding a recommendation for Americans to wear cloth face coverings when leaving their homes.\nAnd U.S. leaders’ rhetoric around the outbreak is still dire, with many Americans in states across the country preparing to remain under stay-in-place orders for at least the coming weeks.\nOn Sunday, U.S. Surgeon General Vice Admiral Jerome Adams told Fox News on Sunday that this coming week “is going to be the hardest and the saddest week of most Americans’ lives, quite frankly,” adding that it will be “our Pearl Harbor moment.” He also noted in the interview, however, that Americans could “change the trajectory of this epidemic” by following social distancing guidelines.\nAnd for equity markets, visibility as to the duration and extent of the outbreak would be a welcomed respite. Stocks ended last week lower as volatility returned to equity markets following the prior week’s advances, as rapidly deteriorating economic data began to reflect the impact of the coronavirus outbreak. The March jobs report – which collected data just through about the 12th of the month – already showed U.S. employers cut 701,000 non-farm payrolls, before widespread social distancing measures had even gone into effect.\nWith this in mind, Thursday’s initial jobless claims report will again be a closely watched print, with consensus economists expecting to see 5 million new unemployment claims filed for the week ended April 4. The prior week, jobless claims skyrocketed to a record 6.648 million.\n—\n6:25 p.m. ET Sunday: Stock futures rise\nHere were the main moves during the overnight session for equity futures, as of 6:25 p.m. ET on Sunday:\nSP 500 futures (ES=F): up 37 points, or 1.49% to 2,519.75\n\nDow futures (YM=F): up 288 points, or 1.37% to 21,245.00\n\nNasdaq futures (NQ=F): up 125.5 points, or 1.67% to 7,648.25\n\n\n—\n6:18 p.m. ET Sunday: Boeing extends closure of Puget Sound, Washington operations\nBoeing (BA) said in an announcement Sunday that it is extending the production facility closures at its Puget Sound, Washington-area facilities, “in light of the company's continuing focus on the health and safety of employees, current assessment of the spread of COVID-19 in Washington state, the reliability of the supply chain and additional recommendations from government health authorities.”\nPreviously, Boeing had anticipated a 14-day temporary suspension of these facilities in Washington state, starting March 25. At the time, Boeing said it would grant paid leave to employees who could not work from home for 10 days. Boeing did not provide an update on its leave policy in its latest public announcement Sunday.\nThe floor of the New York Stock Exchange (NYSE) stands empty as the building prepares to close indefinitely due to the coronavirus disease (COVID-19) outbreak in New York, U.S., March 20, 2020. REUTERS/Lucas Jackson\nMore\n—\nFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit.\nFind live stock market quotes and the latest business and finance news\nFor tutorials and information on investing and trading stocks, check out Cashay"}
{"id": "74198627", "timestamp": "2020-04-05 23:55:46+00:00", "source": "indiatimes.com", "title": "Seized vehicles will be released after payment of fine: Police | Mangaluru News - Times of India", "body": "Mangaluru: The owners of more than 600 vehicles seized by the Mangaluru city traffic police for violating lockdown orders have been booked under Indian Penal Code Section 270 (malignant act likely to spread infection of any disease dangerous to life) and Motor Vehicles Act, said a senior police source.“These vehicles are seized to prevent people from commuting, which can lead to the spread of Covid-19. We had seen people taking joy rides across the city, due to which we have stopped them. The city police personnel have seized more than 600 motorbikes and fined the offenders under IPC Section 270 and the Motor Vehicles Act,” said a senior police source.The source added: “The police will only release the vehicles after appropriate fines are paid for the violations. It is advisable that everyone stays at home and that they do not to venture out aimlessly. It is in the larger interest of society. The drive of seizing vehicles will continue till the lockdown is in force.”Another official from the traffic division revealed that the seizure of vehicle has resulted in less unnecessary movement of motorists."}
{"id": "74198612", "timestamp": "2020-04-05 23:55:45+00:00", "source": "indiatimes.com", "title": "No cases in Gurgaon in past five days, but testing curve slopes too | Gurgaon News - Times of India", "body": "Gurgaon: The district of Gurgaon may not have reported any novel coronavirus (Covid-19) case in the past five days, but the fact that fewer people have been tested daily since March 18, as revealed by government data, could be a factor.Moreover, only 365 samples have so far been taken in a city that has a population of more than 25 lakh.From a high of 50 people tested on March 21, the number dwindled to 23 on Sunday. The number of people screened at the two civil and 12 private hospitals under government surveillance is a mere 5,974, most of whom were not tested.The number of daily screenings has also declined. On March 18, 19 and 20, the department screened 1,527, 723 and 1,358 people, respectively. From March 26, when only 258 people were screened, the figure dipped to just 30 people on March 27, 26 on March 28 and 49 on March 29.Gurgaon does not have any government testing centres for Covid-19 yet.Even though private players have been roped in by the government, they have to send samples to PGI Rohtak for validation.“Tests are conducted on people with symptoms. Everybody doesn’t need to be tested. People with travel history but no symptoms of Covid-19 are being quarantined,” said JS Punia, CMO."}
{"id": "74198570", "timestamp": "2020-04-05 23:55:43+00:00", "source": "business-standard.com", "title": "Pimpri Chinchwad: 3 COVID-19 patients test negative,to go home", "body": "Three COVID-19 patients from Pimpri \n\n\n\nChinchwad area in Pune district, whose repeat samples tested negative on Thursday, will be discharged from the hospital on Friday, an official said.\n\n\"The three patients, who tested negative two times after their 14 days of isolation period, will be discharged from the hospital shortly today,\" a health official from Pimpri Chinchwad Municipal Corporation (PCMC) said.\n\nPimpri Chinchwad has so far recorded 12 coronavirus positive cases, the official said, adding that no new case was detected in the last seven days."}
{"id": "74198568", "timestamp": "2020-04-05 23:55:42+00:00", "source": "msnbc.com", "title": "IMF chief Georgieva says the world is in a recession, containment will dictate strength of recovery", "body": "International Monetary Fund chief Kristalina Georgieva said Friday that the global economy is now in a recession thanks to COVID-19, but that she's heartened to see world leaders finally realizing that only a coordinated effort will be able to stem the spread of the novel coronavirus.\n\n\"We have stated that the world is now in recession and that the length and depth of this recession depend on two things: Containing the virus and having an effective, coordinated response to the crisis,\" she told CNBC's Sara Eisen.\n\n\"I'm very encouraged by what I see now. I see much clearer understanding [among global leaders] that if we don't beat it everywhere we won't be able to get out of it,\" she added.\n\n\"We should not go ... with small measures now when we know that it is a gigantic crisis,\" she said minutes later. \"We've never seen the world economy standing still. Now we [do]. How we go about revitalizing it is another important topic.\"\n\nThe IMF has taken extraordinary measures in recent weeks to help combat the economic toll COVID-19, and efforts to contain its spread, has had on economies around the globe.\n\nOn March 16 the international body said it \"stands ready\" to use its $1 trillion lending capacity to help countries around the world that are struggling with the humanitarian and economic impact of the novel coronavirus.\n\nGeorgieva wrote at the time that such support could be used to aid its members, especially emerging and developing countries. The IMF's Catastrophe Containment and Relief Trust \"can help the poorest countries with immediate debt relief, which will free up vital resources for health spending, containment, and mitigation.\"\n\nHer comments came near the end of yet another violent week on Wall Street, with the S&P 500 down nearly 3% in midday trading in New York. Both the S&P 500 and Dow industrials are up more than 10% this week, however, after the Federal Reserve moved to pump cash into the U.S. economy through historic easing policies and zero-interest loans.\n\nAmerican investors also found relief in moves by Congress toward a massive, $2 trillion stimulus package that, if passed, would provide millions of citizens with quick infusions of cash among other provisions.\n\nThe S&P 500 and Dow Jones are each down at least 25% from their all-time highs hit as recently as February.\n\nSubscribe to CNBC PRO for exclusive insights and analysis, and live business day programming from around the world."}
{"id": "74198566", "timestamp": "2020-04-05 23:55:41+00:00", "source": "abc.net.au", "title": "Australian doctors design and make medical equipment needed to fight coronavirus", "body": "Australian doctors who are worried the system will not be able to provide them with the equipment they need to protect themselves and their patients during the COVID-19 pandemic are looking at ways to design and produce their own.\n\nDoctors are concerned about the availability of equipment to protect both themselves and patients, one Melbourne anaesthetist, who wished to remain anonymous, told the ABC.\n\n\"Many doctors and health professionals are very concerned and confused about the requirements for, and current supply of, personal protective equipment (PPE) for hospitals,\" she said.\n\n\"Some hospitals now have less than one week of available stock of this type of equipment to deal with any potential or known COVID-positive patients.\n\n\"This situation is applicable to normal or emergency surgery, emergency rooms and inpatient ward care, as well as the treatment of COVID-positive patients.\"\n\nA large centralised group involving Victorian university staff, clinicians and manufacturers has been working tirelessly to develop suitable products and to co-ordinate the supply and demand of these essential items, and it has begun to network with other similar groups across Australia and internationally.\n\nThey have reached out to philanthropical organisations and local engineers and manufacturers to open up supply lines and found them keen to help.\n\nThe PPE items they are working to create in order to reduce the risk to staff and secure their safety include:\n\nOn top of the doctors' efforts, a Department of Health and Human Services (DHHS) task force has been established to assess this dynamic supply and demand situation, while the Federal Department of Industry, Science, Energy and Resources has set up a ventilator task force.\n\nAll DHHS-supplied equipment needs to be approved by the Therapeutic Goods Administration (TGA).\n\nThe TGA has created a rapid approval process to speed this up for COVID-related equipment.\n\nCon Kolivas, a retired anaesthetist and software engineer who is helping to coordinate one of the groups, said it started as a casual chat between a few people about the lack of ventilators in Italy at the time.\n\nThey wondered whether it would be possible for Australia to build some kind of simple ventilator in case of a shortage locally.\n\n\"The rate of infection of medical staff in the worst-affected areas overseas is now very high and, to make matters worse, doctors who've been infected at the front line appear to have a higher death rate than people who've caught it in the community,\" he said.\n\n\"I and others approached people from different disciplines in industry, medicine, engineering, software and so on about what we could do and found a cohort of people willing to help out.\n\n\"After the initial discussion about ventilators, talks turned to things we could manufacture locally and personal protective equipment (PPE) was top of the list.\n\n\"Government and health suppliers don't actually give us any of this sort of equipment, so we needed to innovate because there isn't an easy path to find these novel pieces of equipment.\"\n\nEmergency physician and intensive care fellow Arun Ilancheran said a severe shortage of equipment was looming.\n\n\"Our group feels is it imperative that we source local engineers and manufacturers to continue to have the supply chain of the essential equipment that we need to save lives during this pandemic.\n\n\"We are aware that as the lockdown phase gets stricter, we will have further supply chain issues.\"\n\nDr Kolivas said the Victorian Government was keen to support any firm designs the group could come up with, but for any complex designs, the regular government channels of approval and funding could slow things down.\n\nFortunately, various philanthropical organisations were also very willing to assist, he said.\n\n\"With the help of 3D printing it makes it possible to tackle any kind of design we want,\" Dr Kolivas said.\n\n\"The problem with 3D printing is it's slow, so it's great for producing the prototypes, but you can't mass produce them if each one takes two hours to print.\"\n\nThat is where support from local manufacturers comes in.\n\nDr Kolivas said that, again, there was a desire to help.\n\nToyota is one example of a company which has offered its design and engineering capabilities to produce equipment on a large scale.\n\nCrucially, Dr Kolivas said, ventilator manufacturer Medtronic had opened up one of its designs for free use during the pandemic, without intellectual property restrictions, meaning there was potential for manufacturers to produce the vital piece of equipment in Australia.\n\nA website, COVID SOS, has been set up as a central hub for the various groups out there working on novel solutions.\n\nIt is also trying to address frontline medical equipment shortages through community-sourced methods of design and manufacture.\n\nHere are some examples of the equipment the group is working on:\n\n\"The \"intubation box\" is an example of an alternative novel PPE to deal with the unique threat of coronavirus. When a patient is so severely affected by the respiratory complications that they need to be put on a ventilator, they need to have a tube put into their trachea to connect them up to the ventilator. That particular procedure puts the doctor (usually an anaesthetist, intensive care specialist, or emergency physician) and assisting staff in very close proximity with the patient's respiratory tract — they're literally staring down the patient's throat. The potential for aerosol exposure there is extreme, and our clinicians had seen perspex shells used overseas for that scenario to limit that exposure. We developed our own solution, as you can see in the diagram, where the patient is under perspex with rubber-like seals to drop around the patient, and it has self-sealing hand holes for the clinicians to do their intubation. The design was revised and simplified a few times and is made from laser-cut perspex, so is ultimately not that complex to build, which is important. It has been tested clinically with success already and we're looking to produce a number of these for multiple hospitals.\"\n\n\"The facial shield is a very simple guard to/from the staff member which provides an impermeable barrier to any aerosols being sprayed in either direction. It obviously doesn't provide a perfect airtight seal but it affords a great deal of confidence when performing procedures on infected patients. We were able to prototype these from an open-source design on the internet and 3D print them. 3D printing has allowed us to rapidly get a design built, so it allows for rapid prototyping, but is very slow in production. A local manufacturer has taken up the need for facial shield designs and has said they'll be able to produce them in the thousands. We have been connecting hospital networks with this manufacturer to allow them to test out their prototypes and they should be able to order them immediately.\""}
{"id": "74198541", "timestamp": "2020-04-05 23:55:39+00:00", "source": "yahoo.com", "title": "Oil Retreats as Meeting Delay Raises Doubts for Price War Truce", "body": "(Bloomberg) -- Crude fell sharply in Asia after a delay to a planned meeting of top producers to discuss output curbs raised doubts over the prospects for an agreement.\nBrent futures dropped as much as 12%, after jumping almost 14% on Friday. The OPEC+ bloc including Russia will hold a virtual gathering on April 9 instead of Monday after fresh divisions emerged. Saudi Arabia and Russia have indicated that they want the U.S. to join any agreement, but President Donald Trump had only hostile words for OPEC on Saturday, and threatened tariffs on foreign oil.\nState oil producer Saudi Aramco has delayed until Thursday an announcement on its official selling prices for May, according to people with knowledge of the situation, to await signs of what may happen at the meeting. That comes as the International Energy Agency said that the deepest production cuts in the oil industry’s history wouldn’t be enough to steady a crude market in which demand has been ravaged by the coronavirus.\n“The likelihood of a deal being done is extremely low,” said Daniel Hynes, senior commodities strategist at ANZ Bank. “Certainly the type of agreement you’d need to stabilize the market is a long shot given how much demand had been hit.”\nBrent crude fell $2.14 a barrel to $31.97 at 6:52 a.m. Singapore time after earlier dropping to as low as $30.03. The contract’s six-month contango widened to $5.58 a barrel from $3.96 on Friday.\nWest Texas Intermediate futures in New York declined 7.3% to $26.28 a barrel after earlier dropping as much as 11%.\nBrent futures rallied 37% last week, while WTI ended the week up 32%, as Riyadh and Moscow appeared to move toward a resolution to their damaging battle for market share. Prices are still less than half the levels at the start of the year, with the coronavirus crisis crushing demand.\nFor more articles like this, please visit us at bloomberg.com\nSubscribe now to stay ahead with the most trusted business news source.\n©2020 Bloomberg L.P."}
{"id": "74198507", "timestamp": "2020-04-05 23:55:23+00:00", "source": "thehill.com", "title": "Fauci, Navarro got into heated argument over unproven COVID-19 treatment: report", "body": "Dr. Anthony Fauci Anthony FauciSunday shows preview: As coronavirus spreads in the U.S., officials from each sector of public life weigh in Trump warns 'there will be a lot of death' in the coming week How deadly is the coronavirus? MORE, the nation's top infectious disease expert, reportedly clashed recently with President Trump Donald John TrumpPelosi eyes end of April to bring a fourth coronavirus relief bill to the floor NBA to contribute 1 million surgical masks to NY essential workers Private equity firm with ties to Kushner asks Trump administration to relax rules on loan program: report MORE's top trade representative Peter Navarro over the malaria drug hydroxychloroquine and its use as a possible treatment for COVID-19.\n\nDuring a meeting Saturday first reported by Axios, Navarro reportedly accused Fauci of opposing the administration's temporary ban on travel from China after Fauci cautioned against the administration promoting the use of hydroxychloroquine to treat coronavirus.\n\n\"You were the one who early on objected to the travel restrictions with China,\" Navarro reportedly told Fauci.\n\nThere's no evidence Fauci has ever publicly criticized the administration's approach to travel from China amid the outbreak, and on March 12 Fauci praised such a policy during a press briefing.\n\nTrump officials including the president himself have touted the possibility of hydroxychloroquine as a treatment for coronavirus, though the drug is not proven to be effective according to Fauci himself during a recent press conference.\n\n\"The answer is no,\" he said in late March, adding: \"And the evidence that you're talking about ... is anecdotal evidence.\"\n\n\"There has never been a confrontation in the task force meetings like the one yesterday,\" one source familiar with Fauci and Navarro's dispute told Axios. \"People speak up and there's robust debate, but there's never been a confrontation. Yesterday was the first confrontation.\"\n\nThe White House did not immediately return a request for comment on the exchange from The Hill.\n\nCoronavirus cases in the U.S. have topped 300,000 as of the latest numbers from the Centers for Disease Control and Prevention (CDC)."}
{"id": "74198475", "timestamp": "2020-04-05 23:54:09+00:00", "source": "ctvnews.ca", "title": "Surrey should delay its police transition due to outbreak, city councillor says", "body": "SURREY -- \n\tSurrey city councillor Linda Annis was against the transition to a municipal police force before the COVID-19 outbreak. Now, she says, she’s even more concerned.\n\n\n\t“We’re in a crisis right now in B.C., Canada and throughout the world,” Annis said. “This not the time for us to be changing badges for the sake of changing badges.”\n\n\n\tAnnis points to the economic hardship many people in Surrey and other Lower Mainland municipalities are dealing with right now, with business closing down and laying off employees.\n\n\n\tThe City of Surrey itself has temporarily let go of 140 full-time staff members at Surrey libraries.\n\n\n\t“People are unemployed, worrying about rent, mortgage payments and something as simple as putting food on the table for their families,” Annis added.\n\n\n\tShe said the city needs to be focusing on providing that kind of service to people now, not focusing on the transition to a new police force.\n\n\n\tSurrey mayor Doug McCallum’s plan is to have the force running by this time next year, at a cost of $192-million in its first 12 months.\n\n\n\tOn Sunday, the city said it needed more time before it could officially announce whether COVID-19 would impact the transition, but a Surrey resident shared an email with CTV News that hinted a possible response.\n\n\n\tThe email, signed by the Surrey Policing Transition Team and dated March 17, reads, in part, “at this time there is no impact from COVID-19 on the delivery of the policing transition project.”\n\n\n\tThe provincial government also said it needed more time to provide a comment on where it stands in regard to a possible delay in the Surrey police transition because of COVID-19.\n\n\n\tMeanwhile, Annis said she will continue to call on the province to order a referendum on the transition."}
{"id": "74198467", "timestamp": "2020-04-05 23:54:05+00:00", "source": "indiatimes.com", "title": "Startups demand liquidity lifeline to stay afloat - ETtech", "body": "Illustration: Rahul AwasthiIndia's startups are lobbying the government for a lifeline as they cope with an existential liquidity crisis amid a disruption of their ecosystem due to Covid-19, the national lockdown and a spiraling global market. Half of them may be forced to close if no support is forthcoming, according to one of the letters sent to the finance minister.Startups sought loans free of interest or linked to income tax and goods and service tax (GST) refunds to meet funding needs in a March 30 letter to finance minister Nirmala Sitharaman signed by the Confederation of Indian Industry, Nasscom, Indian Private Equity and Venture Capital Association as well as leading entrepreneurs and venture capital investors. Among the 75 signatories are Kris Gopalakrishnan, Rajan Anandan, TV Mohandas Pai, Arihant Patni and Mukesh Bansal.The startups want public sector banks and state-controlled Small Industries Development Bank of India (Sidbi), the implementing agency of the ₹10,000 crore Fund-of-Funds, to offer loans up to the full extent of the refunds they're due.\"These refunds are undisputed... but are yet to get transferred to the startups due to various reasons,\" said Siddarth Pai, founding partner of 3one4 Capital and a signatory to the March 30 joint letter.\"While these are assets on the balance sheet of the startups, what's needed now is the translation of this to cash,\" said the letter.This will provide startups with liquidity for the near-to-short-term without stressing government resources, the note said.\"Covid crisis threatens to destroy all of the progress and future potential of our startup ecosystem in a few short months,\" the letter stated. \"We seek your urgent intervention to help ensure India's startup ecosystem survives... We need the startup ecosystem to survive in order to help the economy bounce back.\"Another communication from LocalCircles, an online community platform that represents 29,000 startups and small and medium enterprises (SMEs), to the finance minster said \"startups want that some or all of CSR (corporate social responsibility) funds be permitted into startups as grants\".Companies should be allowed to invest in startups and avail CSR benefits and claim it's CSR, the letter said. \"The startup and SME community is hopeful that the government will consider these asks with the highest importance,\" said the March 31 LocalCircles note. \"It is critical for startups and SMEs to survive... and if nothing is done, at least 50% of them will soon be shut.\" ET has seen both the letters.Venture capital firms have issued warnings to portfolio companies and the broader ecosystem to conserve cash and tighten spending, given the worsening macroeconomic climate and meltdown of global indices. Ecommerce and food delivery unicorn startups have been struggling because of the lockdown. Some of the top startups in the country are reported to have started cutting staff costs.\"The government's focus rightfully seems to be on health and like in the past it will come to the rescue of the startup ecosystem soon,\" said Sanjay Mehta, founder, 100X. \"Also, the corporate venture capitalist as an asset class has gone away due to the current situation, and any access to fresh capital in small businesses will be the only way growth will come.\"Multiple ongoing deals talks have been shelved or put on hold citing force majeure, threatening companies that don't have adequate funding to last out the crisis, ET has reported.Follow and connect with us on Twitter, Facebook, Linkedin"}
{"id": "74198469", "timestamp": "2020-04-05 23:54:05+00:00", "source": "news.com.au", "title": "Year 12 could be extended into next year in the wake of coronavirus", "body": "Education ministers are looking at every trick in the book to ensure year 12 students finish school this year despite the mayhem caused by coronavirus. \nConcerns have been raised about how the disruption caused by COVID-19 could damage year 12 results.\nState and federal ministers will meet on Tuesday to canvass options including extending the academic year or postponing final exams. They will also discuss boosting overall scores and changing university application procedures.\nVictorian Premier Daniel Andrews has floated the possibility of extending year 12 into next year - a year 13, but his federal counterpart is not keen.\n“All options will be considered tomorrow when we meet – that is an outlier option – that is in a very worst case scenario,” Federal Education Minister Dan Tehan told Seven on Monday.\n“The hope is that we will be able to get everyone through this year.”\nState and territory curriculum and assessment authorities will present all available options to the meeting.\nMr Tehan said responses to the pandemic would likely vary between jurisdictions.\n“But there is a collective will among all education ministers for us to be able to ensure that all those year 12 students will be able to complete their studies this year,” he said.\n“And then go on to university, vocational education or employment next year.”\n- with AAP."}
{"id": "74198468", "timestamp": "2020-04-05 23:54:04+00:00", "source": "indiatimes.com", "title": "Cities take to drones to keep services up - ETtech", "body": "Drones have been used for many things, but this may perhaps be a first. Across India, city corporations and police are tapping drone operators to better enforce the lockdown, spray disinfectants, identify clusters of people showing signs of sickness and for quick delivery of medicines and medical supplies.In the time of the Covid-19 virus outbreak, drones are being viewed as tools to limit human exposure.Firms such as Garuda Aerospace, Marut Drones, IIO Technologies, The Drone Federation of India and initiatives like Droneman.in are actively partnering with other firms to cater to the demand.Several of them have repurposed agricultural drones to spray disinfectants and are using micro drones with cameras to help police in surveillance. \"We've been working with the Telangana government for the past two weeks. We started with disinfecting drones, then we started with surveillance because everything is locked down,\" said Prem Kumar Vislawath, chief innovator at Marut Drones.China, Singapore and other Southeast Asian countries are also extensively utilising drones for various missions over the past few weeks. \"We will spray disinfectant (using drones) so that there is no human intervention,\" Gaurang Rathi, CEO of Varanasi, said. \"This will also be done in offices - municipal and district administration, health department, where we are doing work every day.\"The city administration has identified Chennai-based Garuda Aerospace, which builds drones locally, for the operations. \"We can cover four to five times more distance using drones than a human can do in a day,\" said Agnishwar Jayaprakash, founder of Garuda Aerospace, which has deployed drones in Raipur in Chhattisgarh, and Namakkal and Tiruvarur in Tamil Nadu.\"The drones can reach heights of up to 100 metres and cover more area. We can automate 80% of the spraying without human intervention\".One of the biggest and easiest use cases for drones is surveillance. \"It's not just a flying CCTV camera, it's a flying CCTV camera with an operator. This way, the operators can specifically tell the authorities if there is a problem in an area or not,\" said Smit Shah, director of partnerships at The Drone Federation of India. The organisation is utilising its base of drone operators and putting them in touch with local authorities, he added. In Tamil Nadu, the state electricity board, TN Generation and Distribution Corporation (Tangedco) has deployed drones to sanitise around 25 sub-stations as a pilot to deal with the spread of the virus.Bengaluru-based IIO Technologies has also deployed drones for crowd control and to monitor the body temperature of people in several locations in Delhi. In Bengaluru, the firm has deployed its drones in HSR Layout and operations in a few other areas are ongoing. Amber Dubey, Joint Secretary in the Ministry of Civil Aviation, said that drones will benefit in areas such as agriculture, disaster management, healthcare and law enforcement. \"The ministry is working with different government entities and industry bodies to simplify procedures and enable rapid growth of the drone industry,\" he said.Follow and connect with us on Twitter, Facebook, Linkedin"}
{"id": "74198457", "timestamp": "2020-04-05 23:53:44+00:00", "source": "hotnewhiphop.com", "title": "British Prime Minister Boris Johnson Hospitalized From Coronavirus", "body": "British Prime Minister Boris Johnson was admitted to the hospital, Sunday, after battling coronavirus symptoms since his March 27 diagnosis.\nDan Kitwood / Getty Images\n\"On the advice of his doctor, the Prime Minister has tonight been admitted to hospital for tests,\" the Prime Minister's Office said in a statement.\nThe decision to go to the hospital was described as a \"precautionary step.\"\n\"Prime Minister continues to have persistent symptoms of coronavirus 10 days after testing positive for the virus,\" Downing Street explained in a statement, Sunday. \"The Prime Minister thanks NHS staff for all of their incredible hard work and urges the public to continue to follow the Government's advice to stay at home, protect the NHS and save lives.\"\n\nCNN's Medical Analyst Dr. Kent Sepkowitz says that the tests Johnson will receive could reveal \"several more variables of lung function and might indicate whether he is just fatigued and spent, or actually in some danger.\" \nIn the time since his diagnosis, Johnson has worked from home and lived in accordance with social distancing guidelines.\nOn Friday, Johnson released an update video on Twitter saying he was still experiencing symptoms: \"I still have a temperature. So in accordance with government advice I must continue my self-isolation until that symptom itself goes.\"\n\n\n\n\n\n\n\nThere are now more than 1.2 million cases of coronavirus around the world. Over 68,000 have died.\n[Via]"}
